adamkondraciuk/nrfx/mdk/nrf5340.svd
<?xml version="1.0" encoding="utf-8"?>
<!-- File naming: <vendor>_<part/series name>_svd.xml -->
<device schemaVersion="1.3.3" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" noNamespaceSchemaLocation="CMSIS-SVD.xsd">
  <vendor>Nordic Semiconductor</vendor>
  <vendorID>Nordic</vendorID>
  <name>nrf5340</name>
  <series>nrf53</series>
  <version>1</version>
  <description>nRF53 reference description for radio MCU with ARM 32-bit Cortex-M33 Microcontroller </description>
  <licenseText>
Copyright (c) 2010 - 2018, Nordic Semiconductor ASA\n
\n
All rights reserved.\n
\n
Redistribution and use in source and binary forms, with or without modification,\n
are permitted provided that the following conditions are met:\n
\n
1. Redistributions of source code must retain the above copyright notice, this\n
   list of conditions and the following disclaimer.\n
\n
2. Redistributions in binary form, except as embedded into a Nordic\n
   Semiconductor ASA integrated circuit in a product or a software update for\n
   such product, must reproduce the above copyright notice, this list of\n
   conditions and the following disclaimer in the documentation and/or other\n
   materials provided with the distribution.\n
\n
3. Neither the name of Nordic Semiconductor ASA nor the names of its\n
   contributors may be used to endorse or promote products derived from this\n
   software without specific prior written permission.\n
\n
4. This software, with or without modification, must only be used with a\n
   Nordic Semiconductor ASA integrated circuit.\n
\n
5. Any software provided in binary form under this license must not be reverse\n
   engineered, decompiled, modified and/or disassembled.\n
\n
THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS\n
OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES\n
OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE\n
DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE\n
LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR\n
CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE\n
GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)\n
HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT\n
LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT\n
OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n
        </licenseText>
  <addressUnitBits>8</addressUnitBits>
  <width>32</width>
  <size>32</size>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xFFFFFFFF</resetMask>
  <cpu>
    <name>CM33</name>
    <revision>r0p2</revision>
    <endian>little</endian>
    <mpuPresent>1</mpuPresent>
    <fpuPresent>1</fpuPresent>
    <nvicPrioBits>3</nvicPrioBits>
    <sauNumRegions>0</sauNumRegions>
    <vendorSystickConfig>0</vendorSystickConfig>
  </cpu>
  <headerSystemFilename>system_nrf5340</headerSystemFilename>
  <headerDefinitionsPrefix>NRF_</headerDefinitionsPrefix>
  <vendorExtensions>
    <MaxInterrupts>240</MaxInterrupts>
  </vendorExtensions>
  <peripherals>
    <peripheral>
      <name>FICR_NS</name>
      <description>Factory Information Configuration Registers 0</description>
      <baseAddress>0x00FF0000</baseAddress>
      <headerStructName>FICR</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>FICR</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>CHIPCONF00</name>
          <description>Miscellaneous analog configuration. Will be set during production test.</description>
          <addressOffset>0x000</addressOffset>
          <access>read-only</access>
          <resetValue>0x8CC41077</resetValue>
          <fields>
            <field>
              <name>CKPUREEN</name>
              <description>Enable clock gate in clock purifier. Should always be 1.</description>
              <lsb>2</lsb>
              <msb>2</msb>
            </field>
            <field>
              <name>PLL_CALIB_ROSC</name>
              <description>HFCLK ring oscillator trim codes. Previous name: HFROSCTRIM.</description>
              <lsb>7</lsb>
              <msb>11</msb>
            </field>
            <field>
              <name>XOSC32KIINTCAPTRIM</name>
              <description>On-chip capacitance trimming for the XOC32KI oscillator</description>
              <lsb>16</lsb>
              <msb>18</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRIM0</name>
                  <description>0 percent</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIM12P5</name>
                  <description>+12.5 percent</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIM25</name>
                  <description>+25 percent</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NA0</name>
                  <description>Forbidden</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NA1</name>
                  <description>Forbidden</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NA2</name>
                  <description>Forbidden</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIMM25</name>
                  <description>-25 percent</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIMM12P5</name>
                  <description>-12.5 percent</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XOSC32KICONSTCURR</name>
              <description>Trimming for the XOC32KI oscillator when used in constant current mode</description>
              <lsb>19</lsb>
              <msb>22</msb>
            </field>
            <field>
              <name>XOSC32MQSRT</name>
              <lsb>23</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>DISABLEREGULATORCLOCKFORCING</name>
              <lsb>24</lsb>
              <msb>24</msb>
            </field>
            <field>
              <name>DISABLEIGNOREANAREADY</name>
              <lsb>25</lsb>
              <msb>25</msb>
            </field>
            <field>
              <name>RC31KICLOCKSYNCDISABLE</name>
              <description>Disable synchronizer on calibration clock request from Rc32kiGenerator.</description>
              <lsb>26</lsb>
              <msb>26</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CHIPCONF01</name>
          <description>Miscellaneous analog configuration. Will be set during production test.</description>
          <addressOffset>0x004</addressOffset>
          <access>read-only</access>
          <resetValue>0xF0DF56FF</resetValue>
          <fields>
            <field>
              <name>CLOCKREQFILTERDISABLE</name>
              <description>Disable glitch-filter on clock sources powerup and standby lines</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XOSC32M</name>
                  <description>Disable glitch-filter on powerUp- and standby lines to XOSC32M</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32ki</name>
                  <description>Disable glitch-filter on powerUp line to Rosc/Xosc/Synth used in clock system A (32ki)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>64M</name>
                  <description>Disable glitch-filter on powerUp line to PLL used in clock system B (64M)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>96M</name>
                  <description>Disable glitch-filter on powerUp line to PLL used in clock system C (96M)</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>176M128M</name>
                  <description>Disable glitch-filter on powerUp line to PLL used in clock system D (176M/128M)</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCPLL</name>
                  <description>Disable glitch-filter on powerUp line to PLL used in clock system E (MCPLL)</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>192M</name>
                  <description>Disable glitch-filter on powerUp line to PLL used in clock system F (192M)</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12M</name>
                  <description>Disable glitch-filter on powerUp line to PLL used in clock system G (12M)</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAMWAITEN</name>
              <description>Enable wait on ready upon accessing SRAM when turned on</description>
              <lsb>12</lsb>
              <msb>12</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CHIPCONF02</name>
          <description>Miscellaneous analog configuration. Will be set during production test.</description>
          <addressOffset>0x008</addressOffset>
          <access>read-only</access>
          <resetValue>0x0004FFFF</resetValue>
          <fields>
            <field>
              <name>FLASHPWRUPCNT</name>
              <description>Number of successful FLASHPWRUPn read cycles when powering up flash. After chip power up, the NVMC controller reads FLASHPWRUPn for 7 us.</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>IFCREADDELAY</name>
              <description>number of cycles before Information Configuration Registers can be read</description>
              <lsb>11</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>WS</name>
              <description>Wait-states (excluding the cache controller) for I-Code flash access, D-Code has one more wait-state.</description>
              <lsb>16</lsb>
              <msb>19</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1WS</name>
                  <description>1 wait-state in total for I-Code (2 for D-Code)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2WS</name>
                  <description>2 wait-state in total for I-Code (3 for D-Code)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3WS</name>
                  <description>3 wait-state in total for I-Code (4 for D-Code)</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4WS</name>
                  <description>4 wait-state in total for I-Code (5 for D-Code)</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>5WS</name>
                  <description>5 wait-state in total for I-Code (6 for D-Code)</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6WS</name>
                  <description>6 wait-state in total for I-Code (7 for D-Code)</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>7WS</name>
                  <description>7 wait-state in total for I-Code (8 for D-Code)</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8WS</name>
                  <description>8 wait-state in total for I-Code (9 for D-Code)</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>9WS</name>
                  <description>9 wait-state in total for I-Code (10 for D-Code)</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10WS</name>
                  <description>10 wait-state in total for I-Code (11 for D-Code)</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11WS</name>
                  <description>11 wait-state in total for I-Code (12 for D-Code)</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12WS</name>
                  <description>12 wait-state in total for I-Code (13 for D-Code)</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>13WS</name>
                  <description>13 wait-state in total for I-Code (14 for D-Code)</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>14WS</name>
                  <description>14 wait-state in total for I-Code (15 for D-Code)</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>15WS</name>
                  <description>15 wait-state in total for I-Code (16 for D-Code)</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CHIPCONF03</name>
          <description>Miscellaneous analog configuration. Will be set during production test.</description>
          <addressOffset>0x00C</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>COMPREFTRIM</name>
              <description>Calibrate internal bandgap reference in COMP</description>
              <lsb>8</lsb>
              <msb>12</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CHIPCONF04</name>
          <description>Configuration for VREGMAIN. Will be set during production test.</description>
          <addressOffset>0x010</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>VMAIN</name>
              <description>VREGMAIN Output voltage selection.</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1V00</name>
                  <description>1.00 V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1V09</name>
                  <description>1.09 V</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1V17</name>
                  <description>1.17 V</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1V26</name>
                  <description>1.26 V</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VMAINBUCKCKSEL</name>
              <description>VREGMAIN Buck  Input clock selection.</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>normal clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVERTED</name>
                  <description>inverted clock</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VMAINLDOCAL</name>
              <description>VREGMAIN LDO Output voltage calibration</description>
              <lsb>4</lsb>
              <msb>6</msb>
            </field>
            <field>
              <name>VMAINHIGH</name>
              <description>Enable or disable the feature</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Nominal output levels of VREGMAIN LDO</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Increased output levels of VREGMAIN LDO</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BUCKDROUTSEL</name>
              <description>0: Minimum driver speed, low efficiency, low noise. 7: Medium driver speed, medium efficiency, medium noise. 15: Maximum driver speed, high efficiency, high noise.</description>
              <lsb>8</lsb>
              <msb>11</msb>
            </field>
            <field>
              <name>ULPDVDDSELREF</name>
              <description>Output voltage calibration. 0: 0.75V ratio of AVDD1V3 output (default) 1: 0.75V reference 2: AVDD1V3 as reference. 3: Reserved for future use.</description>
              <lsb>12</lsb>
              <msb>13</msb>
            </field>
            <field>
              <name>VMAINULPRAIL2RAIL</name>
              <description>DVDD0V9 LDO mode 0 - NMOS only input stage in LDO (default) 1 - Rail2rail input stage in LDO</description>
              <lsb>14</lsb>
              <msb>14</msb>
            </field>
            <field>
              <name>VMAINTHRESHOLD</name>
              <description>Sets the threshold value for VREGMAIN</description>
              <lsb>16</lsb>
              <msb>22</msb>
            </field>
            <field>
              <name>VMAINBUCKCAL</name>
              <description>VREGMAIN BUCK output voltage calibration Output voltage calibration. 0 : Minimum output voltage level. 31: Maximum output voltage level.</description>
              <lsb>23</lsb>
              <msb>27</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CHIPCONF05</name>
          <description>Configuration for VREGANA. Will be set during production test.</description>
          <addressOffset>0x014</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>VANALDOCAL</name>
              <description>VREGANA Output voltage calibration</description>
              <lsb>0</lsb>
              <msb>2</msb>
            </field>
            <field>
              <name>VANAULPCAL</name>
              <description>VREGANA ULP  Output voltage calibration</description>
              <lsb>3</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>min voltage</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>31</name>
                  <description>max voltage</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VANAULPRAIL2RAIL</name>
              <description>AVDD1V3 LDO mode 0: NMOS only input stage in LDO (default) 1: Rail2rail input stage in LDO</description>
              <lsb>8</lsb>
              <msb>8</msb>
            </field>
            <field>
              <name>VCOREULPTEMPGRAD</name>
              <description>Adjusts temperature gradient of reference (to compensate for modelling inaccuracy) 0: most negative gradient. 7: default. 15: most positive gradient.</description>
              <lsb>9</lsb>
              <msb>12</msb>
            </field>
            <field>
              <name>ULPICTRL</name>
              <description>0: minimum current. 7: default. 15: maximum current.</description>
              <lsb>13</lsb>
              <msb>16</msb>
            </field>
            <field>
              <name>ULPRESCTRL</name>
              <description>Output voltage calibration. 0: switched with internal oscillator (default). 1: switched with CLK2K input 2: force always on. 3: force off (PWRUPs must be 0 otherwise default).</description>
              <lsb>17</lsb>
              <msb>18</msb>
            </field>
            <field>
              <name>VCORECTRL</name>
              <description>Spare digital signals</description>
              <lsb>24</lsb>
              <msb>25</msb>
            </field>
            <field>
              <name>VCORECALIBVCO</name>
              <description>Internal oscillator calibration word 0: Low output frequency. 15: Default output frequency. 31: High output frequency.</description>
              <lsb>26</lsb>
              <msb>30</msb>
            </field>
          </fields>
        </register>
