adamkondraciuk/nrfx/mdk/nrf5340.svd
        <register>
          <name>CHIPCONF06</name>
          <description>Configuration for VREGRADIO and VREGNETWORK. Will be set during production test.</description>
          <addressOffset>0x018</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>VRADIOVOUT</name>
              <description>Control the output voltage for VREGRADIO (AVDD_1V3)</description>
              <lsb>0</lsb>
              <msb>1</msb>
            </field>
            <field>
              <name>VRADIOVOUTHIGH</name>
              <description>Control the TBD for VREGRADIO (AVDD_1V3)</description>
              <lsb>2</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>VRADIOTHRESHOLD</name>
              <description>TBD for VREGRADIO (AVDD_1V3)</description>
              <lsb>4</lsb>
              <msb>10</msb>
            </field>
            <field>
              <name>VRADIOULPALWAYSON</name>
              <description>Force VREGRADIO ULP regulators to be always on</description>
              <lsb>11</lsb>
              <msb>11</msb>
            </field>
            <field>
              <name>VRADIOBUCKCALMAXILIM</name>
              <description>TBD</description>
              <lsb>12</lsb>
              <msb>13</msb>
            </field>
            <field>
              <name>VRADIOBUCKCALPFM</name>
              <description>TBD</description>
              <lsb>14</lsb>
              <msb>17</msb>
            </field>
            <field>
              <name>VRADIOBUCKCALPFMICMP</name>
              <description>TBD</description>
              <lsb>18</lsb>
              <msb>20</msb>
            </field>
            <field>
              <name>VRADIOBUCKCALPWM</name>
              <description>TBD</description>
              <lsb>21</lsb>
              <msb>25</msb>
            </field>
            <field>
              <name>VNETWORKVOUT</name>
              <description>Control the output voltage for VREGNETWORK (DVDD_0V9)</description>
              <lsb>26</lsb>
              <msb>29</msb>
            </field>
            <field>
              <name>VNETWORKULPALWAYSHIGH</name>
              <description>Control the output voltage for VREGNETWORK (DVDD_0V9)</description>
              <lsb>30</lsb>
              <msb>30</msb>
            </field>
            <field>
              <name>VRADIOPFMALWAYSONDISABLE</name>
              <description>TBD</description>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CHIPCONF07</name>
          <description>ICMP timeer configuration for VREGRADIO and VREGNETWORK. Will be set during production test.</description>
          <addressOffset>0x01C</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>VRADIOPFMICMPTIMER</name>
              <description>Control the stay-alive time for the VRADIO PFM current comparator</description>
              <lsb>0</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>VNETWORKICMPTIMER</name>
              <description>Control the stay-alive time for the VNETWORK current comparator (DVDD_0V9)</description>
              <lsb>16</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CHIPCONF08</name>
          <description>Configuration for VREGH. Will be set during production test.</description>
          <addressOffset>0x020</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>VREGHBUCKCAL</name>
              <description>VREGH BUCK output voltage fine calibration</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>VREGHBUCKCALILIM</name>
              <description>VREGH BUCK output current limit calibration</description>
              <lsb>5</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>65mA</name>
                  <description>65mA (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>m20pcnt</name>
                  <description>-20 percent</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>p40pcnt</name>
                  <description>+40 percent</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>p20pcnt</name>
                  <description>+20 percent</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VREGHRFSHBUCKCAL</name>
              <description>Refresh mode trim register</description>
              <lsb>7</lsb>
              <msb>8</msb>
            </field>
            <field>
              <name>VREGHLDO2ULPOVERLAPTRIM</name>
              <description>Programmable value for VREGH LDO to ULP overlay counter</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>512us</name>
                  <description>512 us overlay</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1024us</name>
                  <description>1024 us overlay</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VREGHULPICMPTRIM</name>
              <description>Trimming of VREGH_ULP load current measurement</description>
              <lsb>10</lsb>
              <msb>11</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>m30pcnt</name>
                  <description>-30 percent</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>m10pcnt</name>
                  <description>-10 percent (default)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>p10pcnt</name>
                  <description>+10 percent</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>p30pcnt</name>
                  <description>+30 percent</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VREGHVREGICMPTRIM</name>
              <description>Trimming of VREG_VIO load current measurement</description>
              <lsb>12</lsb>
              <msb>13</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>m30pcnt</name>
                  <description>-30 percent</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>m10pcnt</name>
                  <description>-10 percent (default)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>p10pcnt</name>
                  <description>+10 percent</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>p30pcnt</name>
                  <description>+30 percent</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VREGHRFSHPOLLSEL</name>
              <description>Programmable value for counter for poller in PWM mode</description>
              <lsb>14</lsb>
              <msb>15</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>256us</name>
                  <description>256 us polling interval</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>512us</name>
                  <description>512 us polling interval</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1024us</name>
                  <description>1024 us polling interval</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disabled</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VREGHRFSHTRIMPWM</name>
              <description>Trimmed value for refresh mode counter for automatic mode change to PWM</description>
              <lsb>16</lsb>
              <msb>21</msb>
            </field>
            <field>
              <name>VREGHRFSHTRIMULP</name>
              <description>Trimmed value for refresh mode counter for automatic mode change to ULP</description>
              <lsb>22</lsb>
              <msb>27</msb>
            </field>
            <field>
              <name>VREGHULPTRIMCVREF</name>
              <lsb>28</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CHIPCONF09</name>
          <description>Configuration for VREGH. Will be set during production test.</description>
          <addressOffset>0x024</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>VREGHVREGTRIM</name>
              <description>VREGH LDO output voltage trimming</description>
              <lsb>0</lsb>
              <msb>2</msb>
            </field>
            <field>
              <name>VREGHULPTRIM</name>
              <description>Output voltage trimming for VREGH _ULP</description>
              <lsb>3</lsb>
              <msb>5</msb>
            </field>
            <field>
              <name>POWERCFG</name>
              <description>Power configuration for VREGH</description>
              <lsb>6</lsb>
              <msb>13</msb>
            </field>
            <field>
              <name>VREGHTHRESHOLD</name>
              <description>Sets the threshold value for VREGH</description>
              <lsb>14</lsb>
              <msb>20</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CHIPCONF10</name>
          <description>Configuration for Application, Audio and 192M PLLs,</description>
          <addressOffset>0x028</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>APPCTRL</name>
              <description>Power configuration for VREGH</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>APPPROGCHPUMP</name>
              <description>Power configuration for VREGH</description>
              <lsb>4</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>AUDIOCTRL</name>
              <description>Power configuration for VREGH</description>
              <lsb>8</lsb>
              <msb>13</msb>
            </field>
            <field>
              <name>PLL192MCTRL</name>
              <description>Power configuration for VREGH</description>
              <lsb>16</lsb>
              <msb>19</msb>
            </field>
            <field>
              <name>PLL192MPROGCHPUMP</name>
              <description>Power configuration for VREGH</description>
              <lsb>20</lsb>
              <msb>20</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CHIPCONF11</name>
          <description>Configuration for XOSC32M</description>
          <addressOffset>0x02C</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>SLOPE</name>
              <description>Slope trim factor on 2's complement form</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>OFFSET</name>
              <description>Offset trim factor on integer form</description>
              <lsb>5</lsb>
              <msb>9</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CHIPCONF12</name>
          <description>Backdoor trim values for Application VMC</description>
          <addressOffset>0x030</addressOffset>
          <access>read-write</access>
          <resetValue>0xFF88C888</resetValue>
          <fields>
            <field>
              <name>APPBTRIM</name>
              <description>Source Bias Trim Adjustment for retention</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>APPWM</name>
              <description>Write Margin Adjustment</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>APPRM</name>
              <description>Read Margin Adjustment</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>APPRWM</name>
              <description>Read/Write Margin Adjustment</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CHIPCONF13</name>
          <description>RCOSC32K trim values</description>
          <addressOffset>0x034</addressOffset>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>RCOSC32KICALLENGTH</name>
              <description>32kHz RC oscillator calibration length in number of cycles</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>N64</name>
                  <description>64 cycles</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>N128</name>
                  <description>128 cycles</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>N256</name>
                  <description>256 cycles</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>N512</name>
                  <description>512 cycles</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RCOSC32KICOARSEIN</name>
              <description>RCOSC coarse calibration input</description>
              <lsb>8</lsb>
              <msb>13</msb>
            </field>
            <field>
              <name>LFULP32KICALLENGTH</name>
              <description>32kHz ULP RC oscillator calibration length in number of cycles</description>
              <lsb>16</lsb>
              <msb>17</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>N64</name>
                  <description>64 cycles</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>N128</name>
                  <description>128 cycles</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>N256</name>
                  <description>256 cycles</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>N512</name>
                  <description>512 cycles</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LFULP32KICOARSEIN</name>
              <description>LFULP coarse calibration input</description>
              <lsb>24</lsb>
              <msb>29</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CHIPCONF14</name>
          <description>Trim values for Application and Audio PLL</description>
          <addressOffset>0x038</addressOffset>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>APPVCOTRIM128MHZ</name>
              <description>Trim value for the Application PLL VCO at 128MHz</description>
              <lsb>0</lsb>
              <msb>5</msb>
            </field>
            <field>
              <name>AUDIOVCOTRIM11MHZ</name>
              <description>Trim value for the Audio PLL VCO at 11.289MHz</description>
              <lsb>16</lsb>
              <msb>21</msb>
            </field>
            <field>
              <name>AUDIOVCOTRIM12MHZ</name>
              <description>Trim value for the Audio PLL VCO at 12.288MHz</description>
              <lsb>22</lsb>
              <msb>27</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CHIPCONF15</name>
          <description>Trim values for the 192M PLL</description>
          <addressOffset>0x03C</addressOffset>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>VCOTRIM128MHZ</name>
              <description>Trim value for the 192M PLL VCO at 128MHz</description>
              <lsb>0</lsb>
              <msb>5</msb>
            </field>
            <field>
              <name>VCOTRIM144MHZ</name>
              <description>Trim value for the 192M PLL VCO at 144MHz</description>
              <lsb>6</lsb>
              <msb>11</msb>
            </field>
            <field>
              <name>VCOTRIM160MHZ</name>
              <description>Trim value for the 192M PLL VCO at 160MHz</description>
              <lsb>12</lsb>
              <msb>17</msb>
            </field>
            <field>
              <name>VCOTRIM176MHZ</name>
              <description>Trim value for the 192M PLL VCO at 176MHz</description>
              <lsb>18</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>VCOTRIM192MHZ</name>
              <description>Trim value for the 192M PLL VCO at 192MHz</description>
              <lsb>24</lsb>
              <msb>29</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASHPWRUP0</name>
          <description>Power-up pattern for flash</description>
          <addressOffset>0xF0</addressOffset>
          <access>read-only</access>
          <resetValue>0xAAAAAAAA</resetValue>
          <fields>
            <field>
              <name>FLASHPWRUP0</name>
              <description>Power-up pattern for flash</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASHPWRUP1</name>
          <description>Power-up pattern for flash</description>
          <addressOffset>0xF4</addressOffset>
          <access>read-only</access>
          <resetValue>0xAAAAAAAA</resetValue>
          <fields>
            <field>
              <name>FLASHPWRUP1</name>
              <description>Power-up pattern for flash</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASHPWRUP2</name>
          <description>Power-up pattern for flash</description>
          <addressOffset>0xF8</addressOffset>
          <access>read-only</access>
          <resetValue>0xAAAAAAAA</resetValue>
          <fields>
            <field>
              <name>FLASHPWRUP2</name>
              <description>Power-up pattern for flash</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASHPWRUP3</name>
          <description>Power-up pattern for flash</description>
          <addressOffset>0xFC</addressOffset>
          <access>read-only</access>
          <resetValue>0xAAAAAAAA</resetValue>
          <fields>
            <field>
              <name>FLASHPWRUP3</name>
              <description>Power-up pattern for flash</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TESTSTATUS</name>
          <description>Code memory test status. Will be set during production test.</description>
          <addressOffset>0x100</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>TESTSTATUS</name>
              <description>Code memory test status. Will be set during production test.</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
