adamkondraciuk/nrfx/mdk/nrf5340.svd
          <register>
            <name>ROSC3</name>
            <description>Sample count for ring oscillator 3</description>
            <addressOffset>0x018</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>ROSC3</name>
                <description>Sample count for ring oscillator 3</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>ROSC4</name>
            <description>Sample count for ring oscillator 4</description>
            <addressOffset>0x01C</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>ROSC4</name>
                <description>Sample count for ring oscillator 4</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
        </cluster>
      </registers>
    </peripheral>
    <peripheral derivedFrom="FICR_NS">
      <name>FICR_S</name>
      <description>Factory Information Configuration Registers 1</description>
      <baseAddress>0x00FF0000</baseAddress>
      <alternatePeripheral>FICR_NS</alternatePeripheral>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
    </peripheral>
    <peripheral>
      <name>UICR_S</name>
      <description>User Information Configuration Registers User Information Configuration Registers</description>
      <baseAddress>0x00FF8000</baseAddress>
      <headerStructName>UICR</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>UICR</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>APPROTECT</name>
          <description>Access port protection</description>
          <addressOffset>0x000</addressOffset>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>PALL</name>
              <description>Blocks debugger read/write access to all CPU registers and
          memory mapped addresses except for the Control Access Port
          registers.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0xFFFFFFFF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>0x00000000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTSUPPLY</name>
          <description>Enable external circuitry to be supplied from VDD pin. Applicable in 'High voltage mode' only.</description>
          <addressOffset>0x00C</addressOffset>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>EXTSUPPLY</name>
              <description>Enable external circuitry to be supplied from VDD pin (output of VREGH stage).</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>No current can be drawn from the VDD pin.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>It is allowed to supply external circuitry from the VDD pin.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>VREGHVOUT</name>
          <description>GPIO reference voltage / external output supply voltage in 'High voltage mode'.</description>
          <addressOffset>0x010</addressOffset>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>VREGHVOUT</name>
              <description>VREGH regulator output voltage. The maximum output voltage from this stage is given as VDDH - VEXDIF.</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1V8</name>
                  <description>1.8 V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2V1</name>
                  <description>2.1 V</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2V4</name>
                  <description>2.4 V</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2V7</name>
                  <description>2.7 V</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3V0</name>
                  <description>3.0 V</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3V3</name>
                  <description>3.3 V</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>Default voltage: 1.8 V</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>XOSC32MCAPSEL</name>
          <description>Capacitor selection and enable on XC1 and XC2</description>
          <addressOffset>0x014</addressOffset>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>CAPVALUE</name>
              <description>Capacitance value for built-in load caps on XC1 and XC2</description>
              <lsb>0</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>C070</name>
                  <description>Set cap to 7.0 pF</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C075</name>
                  <description>Set cap to 7.5 pF</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C080</name>
                  <description>Set cap to 8.0 pF</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C085</name>
                  <description>Set cap to 8.5 pF</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C090</name>
                  <description>Set cap to 9.0 pF</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C095</name>
                  <description>Set cap to 9.5 pF</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C100</name>
                  <description>Set cap to 10.0 pF</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C105</name>
                  <description>Set cap to 10.5 pF</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C110</name>
                  <description>Set cap to 11.0 pF</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C115</name>
                  <description>Set cap to 11.5 pF</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C120</name>
                  <description>Set cap to 12.0 pF</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C125</name>
                  <description>Set cap to 12.5 pF</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C130</name>
                  <description>Set cap to 13.0 pF</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C135</name>
                  <description>Set cap to 13.5 pF</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C140</name>
                  <description>Set cap to 14.0 pF</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C145</name>
                  <description>Set cap to 14.5 pF</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C150</name>
                  <description>Set cap to 15.0 pF</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C155</name>
                  <description>Set cap to 15.5 pF</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C160</name>
                  <description>Set cap to 16.0 pF</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C165</name>
                  <description>Set cap to 16.5 pF</description>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C170</name>
                  <description>Set cap to 17.0 pF</description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C175</name>
                  <description>Set cap to 17.5 pF</description>
                  <value>21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C180</name>
                  <description>Set cap to 18.0 pF</description>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C185</name>
                  <description>Set cap to 18.5 pF</description>
                  <value>23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C190</name>
                  <description>Set cap to 19.0 pF</description>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C195</name>
                  <description>Set cap to 19.5 pF</description>
                  <value>25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C200</name>
                  <description>Set cap to 20.0 pF</description>
                  <value>26</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Enable on-chip capacitors on XC1 and XC2, value given by CAPVAL</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Capacitor disabled (use external caps)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Capacitor enabled</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TBD</name>
          <description>TDB</description>
          <addressOffset>0x018</addressOffset>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
        </register>
        <register>
          <name>SECUREAPPROTECT</name>
          <description>Secure Access port protection</description>
          <addressOffset>0x01C</addressOffset>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>PALL</name>
              <description>Blocks debugger read/write access to all secure CPU registers and secure
          memory mapped addresses</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0xFFFFFFFF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>0x00000000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ERASEPROTECT</name>
          <description>Erase protection</description>
          <addressOffset>0x020</addressOffset>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>PALL</name>
              <description>Blocks NVMC ERASEALL and CTRLAP ERASEALL functionality</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0xFFFFFFFF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>0x00000000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TINSTANCE</name>
          <description>SW-DP Target instance</description>
          <addressOffset>0x024</addressOffset>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>TINSTANCE</name>
              <description>TINSTANCE bits are negated and used in the SW-DP DLPIDR.TINSTANCE field. E.g. 0xF in this field is translated to 0x0 in DLPIDR.TINSTANCE field.</description>
              <lsb>28</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <dim>0xC0</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>OTP[%s]</name>
          <description>Description collection: OTP bits [31+n*32:0+n*32].</description>
          <addressOffset>0x100</addressOffset>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>OTP</name>
              <description>Bits [31+n*32:0+n*32] of OTP Region</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <cluster>
          <name>KEYSLOT</name>
          <description>Unspecified</description>
          <headerStructName>UICR_KEYSLOT</headerStructName>
          <addressOffset>0x400</addressOffset>
          <cluster>
            <dim>128</dim>
            <dimIncrement>0x008</dimIncrement>
            <name>CONFIG[%s]</name>
            <description>Unspecified</description>
            <headerStructName>UICR_KEYSLOT_CONFIG</headerStructName>
            <addressOffset>0x000</addressOffset>
            <register>
              <name>DEST</name>
              <description>Description cluster: Destination address where content of registers KEYSLOT.KEYn.VALUE[0-3]
          will be pushed by KMU. Note that this address MUST match that of a peripherals
          APB mapped write-only key registers, else the KMU can push this key value into
          an address range which the CPU can potentially read!</description>
              <addressOffset>0x000</addressOffset>
              <access>read-write</access>
              <resetValue>0xFFFFFFFF</resetValue>
              <fields>
                <field>
                  <name>DEST</name>
                  <description>Destination address for key slot n</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>PERM</name>
              <description>Description cluster: Define permissions for key slot n. Bits 0-15 and 16-31 can only be written once.</description>
              <addressOffset>0x004</addressOffset>
              <access>read-write</access>
              <resetValue>0xFFFFFFFF</resetValue>
              <fields>
                <field>
                  <name>WRITE</name>
                  <description>Write permission for key slot n</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Disabled</name>
                      <description>Disable write to registers KEYSLOT.KEYn.VALUE[0-3]</description>
                      <value>0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Enabled</name>
                      <description>Registers KEYSLOT.KEYn.VALUE[0-3] can be written</description>
                      <value>1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>READ</name>
                  <description>Read permission for key slot n.</description>
                  <lsb>1</lsb>
                  <msb>1</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Disabled</name>
                      <description>Disable read from registers KEYSLOT.KEYn.VALUE[0-3]</description>
                      <value>0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Enabled</name>
                      <description>Registers KEYSLOT.KEYn.VALUE[0-3] can be read</description>
                      <value>1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>PUSH</name>
                  <description>Push permission for key slot n</description>
                  <lsb>2</lsb>
                  <msb>2</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Disabled</name>
                      <description>Content of registers KEYSLOT.KEYn.VALUE[0-3] can not be pushed, but can be read if field READ is 'Enabled'</description>
                      <value>0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Enabled</name>
                      <description>Content of registers KEYSLOT.KEYn.VALUE[0-3] can be pushed over secure APB. Register KEYSLOT.CONFIGn.DEST must contain a valid destination address!</description>
                      <value>1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>STATE</name>
                  <description>Revocation state for key slot n</description>
                  <lsb>16</lsb>
                  <msb>16</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Revoked</name>
                      <description>Registers KEYSLOTn.KEY.VALUE[0-3] can no longer be read or pushed</description>
                      <value>0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Active</name>
                      <description>Registers KEYSLOTn.KEY.VALUE[0-3] are readable (if enabled) and can be pushed (if enabled)</description>
                      <value>1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
          </cluster>
          <cluster>
            <dim>128</dim>
            <dimIncrement>0x010</dimIncrement>
            <name>KEY[%s]</name>
            <description>Unspecified</description>
            <headerStructName>UICR_KEYSLOT_KEY</headerStructName>
            <addressOffset>0x400</addressOffset>
            <register>
              <dim>0x4</dim>
              <dimIncrement>0x4</dimIncrement>
              <name>VALUE[%s]</name>
              <description>Description collection: Define bits [31+o*32:0+o*32] of value assigned to key slot n</description>
              <addressOffset>0x000</addressOffset>
              <access>read-write</access>
              <resetValue>0xFFFFFFFF</resetValue>
              <fields>
                <field>
                  <name>VALUE</name>
                  <description>Define bits [31+o*32:0+o*32] of value assigned to key slot n</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                </field>
              </fields>
            </register>
          </cluster>
        </cluster>
