adamkondraciuk/nrfx/mdk/nrf5340.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="PCGCMASTER_CM4SS_S">
      <name>PCGCMASTER_APPMAIN_S</name>
      <description>PCGC Master 1</description>
      <baseAddress>0x50100000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
    </peripheral>
    <peripheral derivedFrom="PCGCMASTER_CM4SS_S">
      <name>PCGCMASTER_APPMCU_S</name>
      <description>PCGC Master 2</description>
      <baseAddress>0x50101000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
    </peripheral>
    <peripheral derivedFrom="GPIOCONFIG_S">
      <name>PCGCSLAVE0_S</name>
      <description>PCGCSlave 1</description>
      <baseAddress>0x50102000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
    </peripheral>
    <peripheral derivedFrom="GPIOCONFIG_S">
      <name>INFOCONF_S</name>
      <description>PCGCSlave 2</description>
      <baseAddress>0x50104000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
    </peripheral>
    <peripheral derivedFrom="GPIOCONFIG_S">
      <name>PPIMATRIX_MCU_S</name>
      <description>PCGCSlave 3</description>
      <baseAddress>0x50105000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
    </peripheral>
    <peripheral derivedFrom="GPIOCONFIG_S">
      <name>WAKEUPPDTIMERS_S</name>
      <description>PCGCSlave 4</description>
      <baseAddress>0x50106000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
    </peripheral>
    <peripheral derivedFrom="GPIOCONFIG_S">
      <name>POWERSWITCH_SLAVE_S</name>
      <description>PCGCSlave 5</description>
      <baseAddress>0x50107000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
    </peripheral>
    <peripheral derivedFrom="GPIOCONFIG_S">
      <name>PCGCSLAVE_RAMBISTHUB_S</name>
      <description>PCGCSlave 6</description>
      <baseAddress>0x50108000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
    </peripheral>
    <peripheral derivedFrom="GPIOCONFIG_S">
      <name>PCGCSLAVE_AMLI_S</name>
      <description>PCGCSlave 7</description>
      <baseAddress>0x50109000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
    </peripheral>
    <peripheral derivedFrom="GPIOCONFIG_S">
      <name>PCGCSLAVE_RESETHANDLER_S</name>
      <description>PCGCSlave 8</description>
      <baseAddress>0x5010A000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
    </peripheral>
    <peripheral derivedFrom="GPIOCONFIG_S">
      <name>PCGCSLAVE_APPMAIN_S</name>
      <description>PCGCSlave 9</description>
      <baseAddress>0x5010B000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
    </peripheral>
    <peripheral derivedFrom="GPIOCONFIG_S">
      <name>APBWUP_TIMER_S</name>
      <description>PCGCSlave 10</description>
      <baseAddress>0x50200000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
    </peripheral>
    <peripheral derivedFrom="PCGCMASTER_CM4SS_S">
      <name>PCGCMASTER_PERMCU_S</name>
      <description>PCGC Master 3</description>
      <baseAddress>0x50201000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
    </peripheral>
    <peripheral derivedFrom="PCGCMASTER_CM4SS_S">
      <name>PCGCMASTER_PERMAIN_S</name>
      <description>PCGC Master 4</description>
      <baseAddress>0x50202000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
    </peripheral>
    <peripheral derivedFrom="PCGCMASTER_CM4SS_S">
      <name>PCGCMASTER_TIMERS_S</name>
      <description>PCGC Master 5</description>
      <baseAddress>0x50203000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
    </peripheral>
    <peripheral derivedFrom="GPIOCONFIG_S">
      <name>PPIMATRIX_TIMERS_S</name>
      <description>PCGCSlave 11</description>
      <baseAddress>0x50204000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
    </peripheral>
    <peripheral derivedFrom="GPIOCONFIG_S">
      <name>PPIMATRIX_PERIPHERALS_S</name>
      <description>PCGCSlave 12</description>
      <baseAddress>0x50205000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
    </peripheral>
    <peripheral derivedFrom="GPIOCONFIG_S">
      <name>PPIMATRIX_IPC_S</name>
      <description>PCGCSlave 13</description>
      <baseAddress>0x50206000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
    </peripheral>
    <peripheral derivedFrom="GPIOCONFIG_S">
      <name>APBWUP_IPC_S</name>
      <description>PCGCSlave 14</description>
      <baseAddress>0x50207000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
    </peripheral>
    <peripheral derivedFrom="PCGCMASTER_CM4SS_S">
      <name>PCGCMASTER_PAC_S</name>
      <description>PCGC Master 6</description>
      <baseAddress>0x50300000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
    </peripheral>
    <peripheral>
      <name>TAD_S</name>
      <description>Trace and debug control</description>
      <baseAddress>0xE0080000</baseAddress>
      <headerStructName>TAD</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>TAD</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>FORCEON</name>
          <description>Force on debug domain</description>
          <addressOffset>0x000</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>FORCEON</name>
              <description>Force on debug domain</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Disable force-on of debug domain</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Enable force-on of debug domain</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ENABLE</name>
          <description>Enable debug domain and aquire selected GPIOs</description>
          <addressOffset>0x500</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>ENABLE</name>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Disable debug domain and release selected GPIOs</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Enable debug domain and aquire selected GPIOs</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <cluster>
          <name>PSEL</name>
          <description>Unspecified</description>
          <headerStructName>TAD_PSEL</headerStructName>
          <addressOffset>0x504</addressOffset>
          <register>
            <name>TRACECLK</name>
            <description>Pin number configuration for TRACECLK</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>PIN</name>
                <description>Pin number</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>CONNECT</name>
                <description>Connection</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disconnected</name>
                    <description>Disconnect</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Connected</name>
                    <description>Connect</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>TRACEDATA0</name>
            <description>Pin number configuration for TRACEDATA[0] and SWO</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>PIN</name>
                <description>Pin number</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>CONNECT</name>
                <description>Connection</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disconnected</name>
                    <description>Disconnect</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Connected</name>
                    <description>Connect</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>TRACEDATA1</name>
            <description>Pin number configuration for TRACEDATA[1]</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>PIN</name>
                <description>Pin number</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>CONNECT</name>
                <description>Connection</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disconnected</name>
                    <description>Disconnect</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Connected</name>
                    <description>Connect</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>TRACEDATA2</name>
            <description>Pin number configuration for TRACEDATA[2]</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>PIN</name>
                <description>Pin number</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>CONNECT</name>
                <description>Connection</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disconnected</name>
                    <description>Disconnect</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Connected</name>
                    <description>Connect</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>TRACEDATA3</name>
            <description>Pin number configuration for TRACEDATA[3]</description>
            <addressOffset>0x010</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>PIN</name>
                <description>Pin number</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>CONNECT</name>
                <description>Connection</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disconnected</name>
                    <description>Disconnect</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Connected</name>
                    <description>Connect</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>TRACEPORTSPEED</name>
          <description>Clocking options for the Trace Port debug interface</description>
          <addressOffset>0x518</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TRACEPORTSPEED</name>
              <description>Speed of Trace Port clock. Note that the TRACECLK pin will output this clock divided by two.</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>32MHz</name>
                  <description>32 MHz Trace Port clock (TRACECLK = 16 MHz)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16MHz</name>
                  <description>16 MHz Trace Port clock (TRACECLK = 8 MHz)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8MHz</name>
                  <description>8 MHz Trace Port clock (TRACECLK = 4 MHz)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4MHz</name>
                  <description>4 MHz Trace Port clock (TRACECLK = 2 MHz)</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
