adamkondraciuk/nrfx/mdk/nrf5340.svd
        <cluster>
          <dim>1</dim>
          <dimIncrement>0x004</dimIncrement>
          <name>EXTPERI[%s]</name>
          <description>Unspecified</description>
          <headerStructName>DCNF_EXTPERI</headerStructName>
          <addressOffset>0x440</addressOffset>
          <register>
            <name>PROTECT</name>
            <description>Description cluster: Control access for Master connected to AMLI master port EXTPERI[n]</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>SLAVE</name>
                <description>Control access to peripherals from master EXTPERI[n].</description>
                <lsb>0</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Allowed</name>
                    <description>Access to peripherals is allowed</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Blocked</name>
                    <description>Access to peripherals is blocked</description>
                    <value>0x7</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <dim>6</dim>
          <dimIncrement>0x004</dimIncrement>
          <name>EXTPERI1[%s]</name>
          <description>Unspecified</description>
          <headerStructName>DCNF_EXTPERI1</headerStructName>
          <addressOffset>0x448</addressOffset>
          <register>
            <name>UNUSED0</name>
            <description>Unspecified</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
          </register>
        </cluster>
        <cluster>
          <dim>1</dim>
          <dimIncrement>0x004</dimIncrement>
          <name>EXTRAM[%s]</name>
          <description>Unspecified</description>
          <headerStructName>DCNF_EXTRAM</headerStructName>
          <addressOffset>0x460</addressOffset>
          <register>
            <name>PROTECT</name>
            <description>Description cluster: Control access from  Master connected to AMLI master port EXTRAM[n]</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>SLAVE0</name>
                <description>Control access to slave 0 of master EXTRAM[n].</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Allowed</name>
                    <description>Access to slave is possible</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Blocked</name>
                    <description>Access to slave is blocked</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SLAVE1</name>
                <description>Control access to slave 1 of master EXTRAM[n].</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Allowed</name>
                    <description>Access to slave is possible</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Blocked</name>
                    <description>Access to slave is blocked</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <dim>6</dim>
          <dimIncrement>0x004</dimIncrement>
          <name>EXTRAM1[%s]</name>
          <description>Unspecified</description>
          <headerStructName>DCNF_EXTRAM1</headerStructName>
          <addressOffset>0x468</addressOffset>
          <register>
            <name>UNUSED1</name>
            <description>Unspecified</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
          </register>
        </cluster>
        <cluster>
          <dim>1</dim>
          <dimIncrement>0x004</dimIncrement>
          <name>EXTCODE[%s]</name>
          <description>Unspecified</description>
          <headerStructName>DCNF_EXTCODE</headerStructName>
          <addressOffset>0x480</addressOffset>
          <register>
            <name>PROTECT</name>
            <description>Description cluster: Control access from  Master connected to AMLI master port EXTCODE[n]</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>SLAVE0</name>
                <description>Control access to slave  0 of master EXTCODE[n].</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Allowed</name>
                    <description>Access to slave is possible</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Blocked</name>
                    <description>Access to slave is blocked</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <dim>6</dim>
          <dimIncrement>0x004</dimIncrement>
          <name>EXTCODE1[%s]</name>
          <description>Unspecified</description>
          <headerStructName>DCNF_EXTCODE1</headerStructName>
          <addressOffset>0x488</addressOffset>
          <register>
            <name>UNUSED2</name>
            <description>Unspecified</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
          </register>
        </cluster>
        <cluster>
          <name>FPGA</name>
          <description>Only exists on FPGA nightly build</description>
          <headerStructName>DCNF_FPGA</headerStructName>
          <addressOffset>0xA00</addressOffset>
          <register>
            <name>SVNREVISION</name>
            <description>SVN revision</description>
            <addressOffset>0x000</addressOffset>
            <access>read-only</access>
            <fields>
              <field>
                <name>SVNREVISION</name>
                <description>SVN revision</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>OFFICIAL</name>
            <description>Official release</description>
            <addressOffset>0x004</addressOffset>
            <access>read-only</access>
            <fields>
              <field>
                <name>OFFICIAL</name>
                <description>Official release</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotOfficial</name>
                    <description>Not official</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Official</name>
                    <description>Official</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RELEASEID0</name>
            <description>Release ID string</description>
            <addressOffset>0x008</addressOffset>
            <access>read-only</access>
            <fields>
              <field>
                <name>BYTE0</name>
                <description>Release ID string byte 0</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>BYTE1</name>
                <description>Release ID string byte 1</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>BYTE2</name>
                <description>Release ID string byte 2</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>BYTE3</name>
                <description>Release ID string byte 3</description>
                <lsb>24</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>RELEASEID1</name>
            <description>Release ID string</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-only</access>
            <fields>
              <field>
                <name>BYTE4</name>
                <description>Release ID string byte 4</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>BYTE5</name>
                <description>Release ID string byte 5</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>BYTE6</name>
                <description>Release ID string byte 6</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>BYTE7</name>
                <description>Release ID string byte 7</description>
                <lsb>24</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>JOBNUMBER</name>
            <description>Jenkins job number</description>
            <addressOffset>0x010</addressOffset>
            <access>read-only</access>
            <fields>
              <field>
                <name>JOBNUMBER</name>
                <description>Jenkins job number</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>AMLICLOCKDELAY</name>
          <description>AMLI clock delay</description>
          <addressOffset>0xA20</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000003</resetValue>
          <fields>
            <field>
              <name>AMLICLOCKDELAY</name>
              <description>AMLI clock delay</description>
              <lsb>0</lsb>
              <msb>5</msb>
            </field>
          </fields>
        </register>
