adamkondraciuk/nrfx/mdk/nrf5340.svd
                <description>Select secure attribute.</description>
                <lsb>26</lsb>
                <msb>26</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Secure</name>
                    <description>Channel26 has its Secure attribute set</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NonSecure</name>
                    <description>Channel26 has its Non-Secure attribute set</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CHANNEL27</name>
                <description>Select secure attribute.</description>
                <lsb>27</lsb>
                <msb>27</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Secure</name>
                    <description>Channel27 has its Secure attribute set</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NonSecure</name>
                    <description>Channel27 has its Non-Secure attribute set</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CHANNEL28</name>
                <description>Select secure attribute.</description>
                <lsb>28</lsb>
                <msb>28</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Secure</name>
                    <description>Channel28 has its Secure attribute set</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NonSecure</name>
                    <description>Channel28 has its Non-Secure attribute set</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CHANNEL29</name>
                <description>Select secure attribute.</description>
                <lsb>29</lsb>
                <msb>29</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Secure</name>
                    <description>Channel29 has its Secure attribute set</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NonSecure</name>
                    <description>Channel29 has its Non-Secure attribute set</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CHANNEL30</name>
                <description>Select secure attribute.</description>
                <lsb>30</lsb>
                <msb>30</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Secure</name>
                    <description>Channel30 has its Secure attribute set</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NonSecure</name>
                    <description>Channel30 has its Non-Secure attribute set</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CHANNEL31</name>
                <description>Select secure attribute.</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Secure</name>
                    <description>Channel31 has its Secure attribute set</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NonSecure</name>
                    <description>Channel31 has its Non-Secure attribute set</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>LOCK</name>
            <description>Description cluster: Prevent further modification of the corresponding PERM register</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>LOCK</name>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Locked</name>
                    <description>DPPI[n].PERM register can't be changed until next reset</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Unlocked</name>
                    <description>DPPI[n].PERM register content can be changed</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <dim>1</dim>
          <dimIncrement>0x008</dimIncrement>
          <name>GPIOPORT[%s]</name>
          <description>Unspecified</description>
          <headerStructName>SPU_GPIOPORT</headerStructName>
          <addressOffset>0x4C0</addressOffset>
          <register>
            <name>PERM</name>
            <description>Description cluster: Select between Secure and Non-Secure attribute  for pins 0 to 31  of port n. Only a Secure peripheral access a pin  with Secure attribute set.</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>PIN0</name>
                <description>Select secure attribute attribute for PIN0.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Secure</name>
                    <description>Pin0  has its  Secure attribute set</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NonSecure</name>
                    <description>Pin0 has its Non-Secure attribute set</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PIN1</name>
                <description>Select secure attribute attribute for PIN1.</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Secure</name>
                    <description>Pin1  has its  Secure attribute set</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NonSecure</name>
                    <description>Pin1 has its Non-Secure attribute set</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>LOCK</name>
            <description>Description cluster: Prevent further modification of the corresponding PERM register</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>LOCK</name>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Locked</name>
                    <description>GPIOPORT[n].PERM register can't be changed until next reset</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Unlocked</name>
                    <description>GPIOPORT[n].PERM register content can be changed</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <dim>2</dim>
          <dimIncrement>0x008</dimIncrement>
          <name>FLASHNSC[%s]</name>
          <description>Unspecified</description>
          <headerStructName>SPU_FLASHNSC</headerStructName>
          <addressOffset>0x500</addressOffset>
          <register>
            <name>REGION</name>
            <description>Description cluster: Define which FLASH region can contains the Non-Secure Callable (NSC) region n</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>REGION</name>
                <description>Region number</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>LOCK</name>
                <lsb>8</lsb>
                <msb>8</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unlocked</name>
                    <description>This register can be updated</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Locked</name>
                    <description>The content of this register can't be changed until the next reset</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>SIZE</name>
            <description>Description cluster: Define the size of the Non-Secure Callable (NSC) region n</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>SIZE</name>
                <description>Size of the Non-Secure Callable (NSC) region n</description>
                <lsb>0</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>The region n is not defined as a Non Secure Callable region. Normal security attributes (Secure or Non-Secure) are enforced</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>32</name>
                    <description>The region n is defined as Non-Secure Callable with a 32-byte size</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>64</name>
                    <description>The region n is defined as Non-Secure Callable with a 64-byte size</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>128</name>
                    <description>The region n is defined as Non-Secure Callable with a 128-byte size</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>256</name>
                    <description>The region n is defined as Non-Secure Callable with a 256-byte size</description>
                    <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>512</name>
                    <description>The region n is defined as Non-Secure Callable with a 512-byte size</description>
                    <value>5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>1024</name>
                    <description>The region n is defined as Non-Secure Callable with a 1024-byte size</description>
                    <value>6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>2048</name>
                    <description>The region n is defined as Non-Secure Callable with a 2048-byte size</description>
                    <value>7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>4096</name>
                    <description>The region n is defined as Non-Secure Callable with a 4096-byte size</description>
                    <value>8</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>LOCK</name>
                <lsb>8</lsb>
                <msb>8</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unlocked</name>
                    <description>This register can be updated</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Locked</name>
                    <description>The content of this register can't be changed until the next reset</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <dim>2</dim>
          <dimIncrement>0x008</dimIncrement>
          <name>RAMNSC[%s]</name>
          <description>Unspecified</description>
          <headerStructName>SPU_RAMNSC</headerStructName>
          <addressOffset>0x540</addressOffset>
          <register>
            <name>REGION</name>
            <description>Description cluster: Define which RAM region can contains the Non-Secure Callable (NSC) region n</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>REGION</name>
                <description>Region number</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>LOCK</name>
                <lsb>8</lsb>
                <msb>8</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unlocked</name>
                    <description>This register can be updated</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Locked</name>
                    <description>The content of this register can't be changed until the next reset</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>SIZE</name>
            <description>Description cluster: Define the size of the Non-Secure Callable (NSC) region n</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>SIZE</name>
                <description>Size of the Non-Secure Callable (NSC) region n</description>
                <lsb>0</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>The region n is not defined as a Non Secure Callable region. Normal security attributes (Secure or Non-Secure) are enforced</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>32</name>
                    <description>The region n is defined as Non-Secure Callable with a 32-byte size</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>64</name>
                    <description>The region n is defined as Non-Secure Callable with a 64-byte size</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>128</name>
                    <description>The region n is defined as Non-Secure Callable with a 128-byte size</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>256</name>
                    <description>The region n is defined as Non-Secure Callable with a 256-byte size</description>
                    <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>512</name>
                    <description>The region n is defined as Non-Secure Callable with a 512-byte size</description>
                    <value>5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>1024</name>
                    <description>The region n is defined as Non-Secure Callable with a 1024-byte size</description>
                    <value>6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>2048</name>
                    <description>The region n is defined as Non-Secure Callable with a 2048-byte size</description>
                    <value>7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>4096</name>
                    <description>The region n is defined as Non-Secure Callable with a 4096-byte size</description>
                    <value>8</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>LOCK</name>
                <lsb>8</lsb>
                <msb>8</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unlocked</name>
                    <description>This register can be updated</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Locked</name>
                    <description>The content of this register can't be changed until the next reset</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <dim>1</dim>
          <dimIncrement>0x004</dimIncrement>
          <name>XIPREGION[%s]</name>
          <description>Unspecified</description>
          <headerStructName>SPU_XIPREGION</headerStructName>
          <addressOffset>0x580</addressOffset>
          <register>
            <name>PERM</name>
            <description>Description cluster: Access permissions for XIP region n</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000007</resetValue>
            <fields>
              <field>
                <name>EXECUTE</name>
                <description>Configure instruction fetch permissions from XIP region  n.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Enable</name>
                    <description>Allow execution of instruction fetches from XIP region n</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Disable</name>
                    <description>Block request to execute instruction fetches from XIP region n</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WRITE</name>
                <description>Configure write permission for XIP region n.</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Enable</name>
                    <description>Allow write operation to region n</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Disable</name>
                    <description>Block write operation to region n</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>READ</name>
                <description>Configure read permissions for XIP region n.</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Enable</name>
                    <description>Allow read operation from XIP region n</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Disable</name>
                    <description>Block read operation from XIP region n</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>LOCK</name>
                <lsb>8</lsb>
                <msb>8</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unlocked</name>
                    <description>This register can be updated</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Locked</name>
                    <description>The content of this register can't be changed until the next reset</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
