adamkondraciuk/nrfx/mdk/nrf5340.svd
        <cluster>
          <dim>32</dim>
          <dimIncrement>0x004</dimIncrement>
          <name>FLASHREGION[%s]</name>
          <description>Unspecified</description>
          <headerStructName>SPU_FLASHREGION</headerStructName>
          <addressOffset>0x600</addressOffset>
          <register>
            <name>PERM</name>
            <description>Description cluster: Access permissions for FLASH region n</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000017</resetValue>
            <fields>
              <field>
                <name>EXECUTE</name>
                <description>Configure instruction fetch permissions from FLASH region  n.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Enable</name>
                    <description>Allow instruction fetches from FLASH region n</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Disable</name>
                    <description>Block instruction fetches from FLASH region n</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WRITE</name>
                <description>Configure write permission for FLASH region n.</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Enable</name>
                    <description>Allow write operation to region n</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Disable</name>
                    <description>Block write operation to region n</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>READ</name>
                <description>Configure read permissions for FLASH region n.</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Enable</name>
                    <description>Allow read operation from FLASH region n</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Disable</name>
                    <description>Block read operation from FLASH region n</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SECATTR</name>
                <description>Security attribute for FLASH region n</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Non_Secure</name>
                    <description>FLASH region n security attribute is Non-Secure</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Secure</name>
                    <description>FLASH region n security attribute is Secure</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>LOCK</name>
                <lsb>8</lsb>
                <msb>8</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unlocked</name>
                    <description>This register can be updated</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Locked</name>
                    <description>The content of this register can't be changed until the next reset</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <dim>32</dim>
          <dimIncrement>0x004</dimIncrement>
          <name>RAMREGION[%s]</name>
          <description>Unspecified</description>
          <headerStructName>SPU_RAMREGION</headerStructName>
          <addressOffset>0x700</addressOffset>
          <register>
            <name>PERM</name>
            <description>Description cluster: Access permissions for RAM region n</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000017</resetValue>
            <fields>
              <field>
                <name>EXECUTE</name>
                <description>Configure instruction fetch permissions from RAM region  n.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Enable</name>
                    <description>Allow instruction fetches from RAM region n</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Disable</name>
                    <description>Block instruction fetches from RAM region n</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WRITE</name>
                <description>Configure write permission for RAM region n.</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Enable</name>
                    <description>Allow write operation to RAM region n</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Disable</name>
                    <description>Block write operation to RAM region n</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>READ</name>
                <description>Configure read permissions for RAM region n.</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Enable</name>
                    <description>Allow read operation from RAM region n</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Disable</name>
                    <description>Block read operation from RAM region n</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SECATTR</name>
                <description>Security attribute for RAM region n</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Non_Secure</name>
                    <description>RAM region n security attribute is Non-Secure</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Secure</name>
                    <description>RAM region n security attribute is Secure</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>LOCK</name>
                <lsb>8</lsb>
                <msb>8</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unlocked</name>
                    <description>This register can be updated</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Locked</name>
                    <description>The content of this register can't be changed until the next reset</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <dim>27</dim>
          <dimIncrement>0x004</dimIncrement>
          <name>PERIPHID[%s]</name>
          <description>Unspecified</description>
          <headerStructName>SPU_PERIPHID</headerStructName>
          <addressOffset>0x800</addressOffset>
          <register>
            <name>PERM</name>
            <description>Description cluster: List capabilities and Access permissions for the peripheral with ID n</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000012</resetValue>
            <fields>
              <field>
                <name>SECUREMAPPING</name>
                <description>Define configuration capabilities  for TrustZone-M secure attribute</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NonSecure</name>
                    <description>This peripheral is always accessible as a Non-Secure peripheral</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Secure</name>
                    <description>This peripheral is always accessible as a Secure peripheral</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>UserSelectable</name>
                    <description>Non-Secure or Secure attribute for this peripheral is defined by the PERIPHID[n].PERM register</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Split</name>
                    <description>This peripheral implements the  split security mechanism. Non-Secure or Secure attribute for this peripheral is defined by the PERIPHID[n].PERM register</description>
                    <value>3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DMA</name>
                <description>Indicate if the peripheral has DMA capabilities and if DMA transfer  can be assigned to a different security attribute than the peripheral itself</description>
                <lsb>2</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoDMA</name>
                    <description>Peripheral has no DMA capability</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NoSeparateAttribute</name>
                    <description>Peripheral has DMA and DMA transfers always have the same security attribute as assigned to the peripheral</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SeparateAttribute</name>
                    <description>Peripheral has DMA and DMA transfers can have a different security attribute than the one assigned to the peripheral</description>
                    <value>2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SECATTR</name>
                <description>Peripheral security mapping</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Secure</name>
                    <description>Peripheral is mapped in Secure Peripheral Address space.</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NonSecure</name>
                    <description>If SECUREMAPPING == UserSelectable: Peripheral is mapped in Non-Secure Peripheral Address space. If SECUREMAPPING == Split: Peripheral is mapped in Non-Secure and Secure Peripheral Address space.</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DMASEC</name>
                <description>Security attribution for the DMA transfer</description>
                <lsb>5</lsb>
                <msb>5</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Secure</name>
                    <description>DMA transfers initiated by this peripheral have the Secure attribute set.</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NonSecure</name>
                    <description>DMA transfers initiated by this peripheral have the Non-Secure attribute set.</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>LOCK</name>
                <lsb>8</lsb>
                <msb>8</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unlocked</name>
                    <description>This register can be updated</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Locked</name>
                    <description>The content of this register can't be changed until the next reset</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PRESENT</name>
                <description>Indicate if a peripheral is present with ID n.</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotPresent</name>
                    <description>Peripheral is not present</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>IsPresent</name>
                    <description>Peripheral is present</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
