adamkondraciuk/nrfx/mdk/nrf5340.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>OSCILLATORS_NS</name>
      <description>Oscillator control 0</description>
      <baseAddress>0x40004000</baseAddress>
      <headerStructName>OSCILLATORS</headerStructName>
      <!--Security dma=NSA-->
      <!--Security securemapping=US-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>OSCILLATORS</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>ATECLOCK</name>
          <description>Analog test bus control for clock modules</description>
          <addressOffset>0x584</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>ROSC32K</name>
              <description>Configure connection of the ROSC32K oscillator  to analog test bus</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
            <field>
              <name>PLL</name>
              <description>Configure connection of PLL to analog test bus</description>
              <lsb>1</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disconnected</name>
                  <description>Disconnect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VC</name>
                  <description>Connect loop filter voltage to ATB0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Osc32MDiv</name>
                  <description>Connect 32 MHz divided clock to ATB1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Both</name>
                  <description>Connect both VC and Osc32MDiv</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPUPLL</name>
              <description>Configure connection of the CPU PLL  to analog test bus</description>
              <lsb>3</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disconnected</name>
                  <description>ATB0 in high impedance</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VTUNE</name>
                  <description>Tune voltage VTUNE on ATB0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSCPLLVHF</name>
                  <description>OSC_PLL_VHF_0V9 on ATB0</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Forbidden</name>
                  <description>Forbidden</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DSPPLL</name>
              <description>Configure connection of the DSP PLL  to analog test bus</description>
              <lsb>5</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disconnected</name>
                  <description>ATB0 in high impedance</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VTUNE</name>
                  <description>Tune voltage VTUNE on ATB0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSCPLLVHF</name>
                  <description>OSC_PLL_VHF_0V9 on ATB0</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Forbidden</name>
                  <description>Forbidden</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XOSC32K</name>
              <description>Configure connection of the XOSC32K oscillator  to analog test bus</description>
              <lsb>7</lsb>
              <msb>8</msb>
            </field>
            <field>
              <name>AUDIOPLL</name>
              <description>Configure connection of the DSP PLL  to analog test bus</description>
              <lsb>9</lsb>
              <msb>10</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disconnected</name>
                  <description>ATB0 in high impedance</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VTUNE</name>
                  <description>Tune voltage VTUNE on ATB0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSCPLL</name>
                  <description>OSC_PLL_0V9 on ATB0</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSCPLL140M</name>
                  <description>OSC_PLL_140M_1V2 on ATB0</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>XOSC32MCAPS</name>
          <description>Programmable capacitance of XC1 and XC2.</description>
          <addressOffset>0x5C4</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CAPVALUE</name>
              <description>Capacitor value = 6 + 0.57*CAPVALUE [pF] If disabled, capacitor value = 3.3 [pF]</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Enable on-chip capacitors on XC1 and XC2</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Capacitor disabled (use external caps)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Capacitor enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BYPASSHFXOSC</name>
          <description>Enable or disable bypass of HFCLK crystal oscillator with external clock source</description>
          <addressOffset>0x600</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>BYPASS</name>
              <description>Enable or disable bypass of HFCLK crystal oscillator with external clock source</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable (use with Xtal or low-swing external source)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable (use with rail-to-rail external source)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIOBYPASS</name>
          <description>Enable bypass from GPIO</description>
          <addressOffset>0x604</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CPUPLL</name>
              <description>Enable bypass from GPIO for the CPU PLL</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Bypass is disabled - CPU PLL is operating normally</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Bypass is enabled - The output signal of the CPU PLL is replaced by the signal applied to the pad</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DSPPLL</name>
              <description>Enable bypass from GPIO for the DSP PLL</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Bypass is disabled - DSP PLL is operating normally</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Bypass is enabled - The output signal of the DSP PLL is replaced by the signal applied to the pad</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AUDIOPLL</name>
              <description>Enable bypass from GPIO for the AUDIO PLL</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Bypass is disabled - AUDIO PLL is operating normally</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Bypass is enabled - The output signal of the AUDIO PLL is replaced by the signal applied to the pad</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <cluster>
          <name>AUDIOPLL</name>
          <description>Unspecified</description>
          <headerStructName>OSCILLATORS_AUDIOPLL</headerStructName>
          <addressOffset>0x640</addressOffset>
          <register>
            <name>BYPASS</name>
            <description>AUDIO PLL bypass control</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>BYPASS</name>
                <description>Enable or disable bypass of AUDIOPLL by an external clock source</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disable</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Enable</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>MUTE</name>
            <description>Mute the AUDIO PLL</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>MUTE</name>
                <description>Mute output clock</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disable</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Enable</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>CTRL</name>
            <description>Collection of test/debug signals</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>PFDDELAY</name>
                <description>Adjust internal PFD delay / CP minimum UP/DN pulse length</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Min</name>
                    <description>Min delay (default)</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>50ps</name>
                    <description>50ps delay</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>100ps</name>
                    <description>100ps delay</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>150ps</name>
                    <description>150ps delay (max)</description>
                    <value>3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>VCOFREQ</name>
                <description>VCO frequency selection (Non-default values are only used for debugging)</description>
                <lsb>2</lsb>
                <msb>4</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>144MHz</name>
                    <description>144MHz(default)</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>128MHz</name>
                    <description>128MHz</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>160MHz</name>
                    <description>160MHz</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>176MHz</name>
                    <description>176MHz</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>192MHz</name>
                    <description>192MHz</description>
                    <value>4</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PROGCHPUMP</name>
                <description>Program Charge Pump Current (only used for debugging)</description>
                <lsb>5</lsb>
                <msb>5</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>1uA</name>
                    <description>1uA (default)</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>2uA</name>
                    <description>2uA</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DISABLESIGMADELTADITHER</name>
                <lsb>6</lsb>
                <msb>6</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NormalOperation</name>
                    <description>Normal operation</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Turn off dither in Sigma-Delta Modulation (auPllDitherOff)</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DISABLESIGMADELTAMODULATION</name>
                <lsb>7</lsb>
                <msb>7</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NormalOperation</name>
                    <description>Normal operation</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Turn off Sigma-Delta Modulation, output is held constant at 0 (auPllSdmOff)</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>UNUSED</name>
                <description>Not used, reserved for future use</description>
                <lsb>8</lsb>
                <msb>9</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>VCOTRIM</name>
            <description>VCO Trim value for the AUDIO PLL</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>VCOTRIM</name>
                <description>VCO Trim value for the AUDIO PLL</description>
                <lsb>0</lsb>
                <msb>5</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>VCOTRIMOVERRIDE</name>
            <description>Control overriding of the VCO Trim values</description>
            <addressOffset>0x010</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>VCOTRIMOVEERIDE</name>
                <description>VCO Trim value for the AUDIO PLL</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>VCO Trim values are coming from FICR</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>VCO Trim values are coming from the VCOTRIM register</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>CPUPLL</name>
          <description>Unspecified</description>
          <headerStructName>OSCILLATORS_CPUPLL</headerStructName>
          <addressOffset>0x660</addressOffset>
          <register>
            <name>BYPASS</name>
            <description>CPU PLL bypass control</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>BYPASS</name>
                <description>Enable or disable bypass of CPUPLL by an external clock source</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disable</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Enable</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>MUTE</name>
            <description>Mute the CPU PLL</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>MUTE</name>
                <description>Mute output clock</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disable</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Enable</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>CTRL</name>
            <description>Control the behavior of the PFD</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>PFDDELAY</name>
                <description>Adjust internal PFD delay / CP minimum UP/DN pulse length</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Min</name>
                    <description>Min delay (default)</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>50ps</name>
                    <description>50ps delay</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>100ps</name>
                    <description>100ps delay</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>150ps</name>
                    <description>150ps delay (max)</description>
                    <value>3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DISABLEPHASEALLIGNMENT</name>
                <description>Adjust internal PFD delay</description>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>UNUSED</name>
                <description>Reserved for future use</description>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
            </fields>
          </register>
