adamkondraciuk/nrfx/mdk/nrf5340.svd
          <register>
            <name>PROGCHPUMP</name>
            <description>Program Charge Pump Current</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>PROGCHPUMP</name>
                <description>Program Charge Pump Current (only used for debugging)</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>1uA</name>
                    <description>1uA (default)</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>2uA</name>
                    <description>2uA</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>VCOTRIM</name>
            <description>VCO Trim value for the CPU PLL</description>
            <addressOffset>0x010</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>VCOTRIM</name>
                <description>VCO Trim value for the CPU PLL</description>
                <lsb>0</lsb>
                <msb>5</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>VCOTRIMOVERRIDE</name>
            <description>Control overriding of the VCO Trim values</description>
            <addressOffset>0x014</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>VCOTRIMOVEERIDE</name>
                <description>VCO Trim value for the CPU PLL</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>VCO Trim values are coming from FICR</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>VCO Trim values are coming from the VCOTRIM register</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>PLL64M</name>
          <description>Unspecified</description>
          <headerStructName>OSCILLATORS_PLL64M</headerStructName>
          <addressOffset>0x680</addressOffset>
          <register>
            <name>BYPASS</name>
            <description>PLL64M bypass control</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>BYPASS</name>
                <description>Enable or disable bypass of PLL64M by an external clock source</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disable</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Enable</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>MUTE</name>
            <description>Mute the PLL64M</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>MUTE</name>
                <description>Mute output clock</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disable</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Enable</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>PROGCHPUMP</name>
            <description>Program Charge Pump Current</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>PROGCHPUMP</name>
                <description>Program Charge Pump Current (only used for debugging)</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>DSPPLL</name>
          <description>Unspecified</description>
          <headerStructName>OSCILLATORS_DSPPLL</headerStructName>
          <addressOffset>0x6A0</addressOffset>
          <register>
            <name>BYPASS</name>
            <description>DSP PLL bypass control</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>BYPASS</name>
                <description>Enable or disable bypass of DSPPLL by an external clock source</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disable</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Enable</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>MUTE</name>
            <description>Mute the DSP PLL</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>MUTE</name>
                <description>Mute output clock</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disable</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Enable</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>FREQ</name>
            <description>Frequency selection</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000004</resetValue>
            <fields>
              <field>
                <name>FREQ</name>
                <description>Frequency selection for the DSP PLL</description>
                <lsb>0</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>128MHz</name>
                    <description>128 MHz</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>144MHz</name>
                    <description>144 MHz</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>160MHz</name>
                    <description>160 MHz</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>176MHz</name>
                    <description>176 MHz</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>192MHz</name>
                    <description>192 MHz (default)</description>
                    <value>4</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>CTRL</name>
            <description>Control the behavior of the PFD</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>PFDDELAY</name>
                <description>Adjust internal PFD delay / CP minimum UP/DN pulse length</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Min</name>
                    <description>Min delay (default)</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>50ps</name>
                    <description>50ps delay</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>100ps</name>
                    <description>100ps delay</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>150ps</name>
                    <description>150ps delay (max)</description>
                    <value>3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DISABLEPHASEALLIGNMENT</name>
                <description>Adjust internal PFD delay</description>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>UNUSED</name>
                <description>Reserved for future use</description>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PROGCHPUMP</name>
            <description>Program Charge Pump Current</description>
            <addressOffset>0x010</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>PROGCHPUMP</name>
                <description>Program Charge Pump Current (only used for debugging)</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>1uA</name>
                    <description>1uA (default)</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>2uA</name>
                    <description>2uA</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>VCOTRIM</name>
            <description>VCO Trim value for the DSP PLL</description>
            <addressOffset>0x014</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>VCOTRIM</name>
                <description>VCO Trim value for the DSP PLL</description>
                <lsb>0</lsb>
                <msb>5</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>VCOTRIMOVERRIDE</name>
            <description>Control overriding of the VCO Trim values</description>
            <addressOffset>0x018</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>VCOTRIMOVEERIDE</name>
                <description>VCO Trim value for the DSP PLL</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>VCO Trim values are coming from FICR</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>VCO Trim values are coming from the VCOTRIM register</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>XOSC32KI</name>
          <description>Unspecified</description>
          <headerStructName>OSCILLATORS_XOSC32KI</headerStructName>
          <addressOffset>0x6C0</addressOffset>
          <register>
            <name>BYPASS32KI</name>
            <description>Enable or disable bypass of LFCLK crystal oscillator with external clock source</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>BYPASS</name>
                <description>Enable or disable bypass of LFCLK crystal oscillator with external clock source</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disable (use with Xtal or low-swing external source)</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Enable (use with rail-to-rail external source)</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>POWERDOWN32KI</name>
            <description>Power up or power down of LFCLK crystal oscillator</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>POWERDOWN32KI</name>
                <description>Power up or power down LFCLK crystal oscillator</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>PowerUp</name>
                    <description>Power up LFCLK crystal oscillator</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PowerDown</name>
                    <description>Power down LFCLK crystal oscillator</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>EXTBIAS</name>
            <description>Control the use of a external bias current</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>EXTBIAS</name>
                <description>Control the use of a external bias current</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Internal bias current is used</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>External bias current is used</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>MUTE</name>
            <description>Disable clock output</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>MUTE</name>
                <description>Disable clock output</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotMuted</name>
                    <description>Clock is outputted on OSC_32K_0V9</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Muted</name>
                    <description>Clock is muted. OSC_32K_0V9 is zero</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>INTCAP</name>
            <description>Control usage of internal load capacitors</description>
            <addressOffset>0x010</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>INTCAP</name>
                <description>Control usage of internal load capacitors</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>External</name>
                    <description>Use external load capacitors</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>C6PF</name>
                    <description>6pF internal load capacitance</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>C7PF</name>
                    <description>7pF internal load capacitance</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>C11PF</name>
                    <description>11pf internal load capacitance</description>
                    <value>3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>CAPTRIM</name>
            <description>On-chip capacitance trimming</description>
            <addressOffset>0x014</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>CAPTRIM</name>
                <description>On-chip capacitance trimming</description>
                <lsb>0</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>TRIM0</name>
                    <description>0 percent</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRIM12P5</name>
                    <description>+12.5 percent</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRIM25</name>
                    <description>+25 percent</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>UNUSED0</name>
                    <description>Reserved for future use</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>UNUSED1</name>
                    <description>Reserved for future use</description>
                    <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>UNUSED2</name>
                    <description>Reserved for future use</description>
                    <value>5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRIMM25</name>
                    <description>-25 percent</description>
                    <value>6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRIMM12P5</name>
                    <description>-12.5 percent</description>
                    <value>7</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>CONSTCURR</name>
            <description>Control Pierce inverter bias current</description>
            <addressOffset>0x018</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>CONSTCURR</name>
                <description>Select bias current control</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Regulated</name>
                    <description>Bias current is controlled by the amplitude regulator</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Constant</name>
                    <description>Bias current is constant</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>CONSTCURRTRIM</name>
            <description>Control current bias when CONSTCURR == 1</description>
            <addressOffset>0x01C</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>CONSTCURRTRIM</name>
                <description>Control current bias when CONSTCURR == 1</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AREGHIGHCURR</name>
            <description>Increase current in amplitude regulator</description>
            <addressOffset>0x020</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>AREGHIGHCURR</name>
                <description>Increase current in amplitude regulator</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
        </cluster>
