adamkondraciuk/nrfx/mdk/nrf5340.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>REGULATORS_NS</name>
      <description>Voltage regulators 0</description>
      <baseAddress>0x40004000</baseAddress>
      <alternatePeripheral>OSCILLATORS_NS</alternatePeripheral>
      <headerStructName>REGULATORS</headerStructName>
      <!--Security dma=NSA-->
      <!--Security securemapping=US-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>REGULATORS</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>MAINREGSTATUS</name>
          <description>Main supply status</description>
          <addressOffset>0x428</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VREGH</name>
              <description>VREGH status</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Inactive</name>
                  <description>Normal voltage mode. Voltage supplied on VDD.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Active</name>
                  <description>High voltage mode. Voltage supplied on VDDH.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DISABLEHPBOR</name>
          <description>Enable or disable HPBOR</description>
          <addressOffset>0x434</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DISABLE</name>
              <description>Enable or disable HPBOR</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable HPBOR</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable HPBOR</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSTEMOFF</name>
          <description>System OFF register</description>
          <addressOffset>0x500</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>SYSTEMOFF</name>
              <description>Enable System OFF mode</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Enter</name>
                  <description>Enable System OFF mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>POFCON</name>
          <description>Power failure comparator configuration</description>
          <addressOffset>0x510</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>POF</name>
              <description>Enable or disable power failure comparator</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>THRESHOLD</name>
              <description>Power failure comparator threshold setting</description>
              <lsb>1</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>V17</name>
                  <description>Set threshold to 1.7 V</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V18</name>
                  <description>Set threshold to 1.8 V</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V19</name>
                  <description>Set threshold to 1.9 V</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V20</name>
                  <description>Set threshold to 2.0 V</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V21</name>
                  <description>Set threshold to 2.1 V</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V22</name>
                  <description>Set threshold to 2.2 V</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V23</name>
                  <description>Set threshold to 2.3 V</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V24</name>
                  <description>Set threshold to 2.4 V</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V25</name>
                  <description>Set threshold to 2.5 V</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V26</name>
                  <description>Set threshold to 2.6 V</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V27</name>
                  <description>Set threshold to 2.7 V</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V28</name>
                  <description>Set threshold to 2.8 V</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HYSTDIS</name>
              <description>Bypass power failure comparator hysteresis</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Normal</name>
                  <description>Hysteresis active</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NoHyst</name>
                  <description>Hysteresis disabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>THRESHOLDVDDH</name>
              <description>Power failure comparator threshold setting for voltage supply on VDDH</description>
              <lsb>8</lsb>
              <msb>11</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>V27</name>
                  <description>Set threshold to 2.7 V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V28</name>
                  <description>Set threshold to 2.8 V</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V29</name>
                  <description>Set threshold to 2.9 V</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V30</name>
                  <description>Set threshold to 3.0 V</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V31</name>
                  <description>Set threshold to 3.1 V</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V32</name>
                  <description>Set threshold to 3.2 V</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V33</name>
                  <description>Set threshold to 3.3 V</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V34</name>
                  <description>Set threshold to 3.4 V</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V35</name>
                  <description>Set threshold to 3.5 V</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V36</name>
                  <description>Set threshold to 3.6 V</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V37</name>
                  <description>Set threshold to 3.7 V</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V38</name>
                  <description>Set threshold to 3.8 V</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V39</name>
                  <description>Set threshold to 3.9 V</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V40</name>
                  <description>Set threshold to 4.0 V</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V41</name>
                  <description>Set threshold to 4.1 V</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V42</name>
                  <description>Set threshold to 4.2 V</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>THRESHOLDVDDL</name>
              <description>Power failure comparator threshold setting for voltage supply on VDDL</description>
              <lsb>12</lsb>
              <msb>15</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>V100</name>
                  <description>Set threshold to 1.0 V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V105</name>
                  <description>Set threshold to 1.05 V</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V110</name>
                  <description>Set threshold to 1.10 V</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V115</name>
                  <description>Set threshold to 1.15 V</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V120</name>
                  <description>Set threshold to 1.20 V</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V125</name>
                  <description>Set threshold to 1.25 V</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V130</name>
                  <description>Set threshold to 1.30 V</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V135</name>
                  <description>Set threshold to 1.35 V</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V140</name>
                  <description>Set threshold to 1.40 V</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V145</name>
                  <description>Set threshold to 1.45 V</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V150</name>
                  <description>Set threshold to 1.50 V</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V155</name>
                  <description>Set threshold to 1.55 V</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V160</name>
                  <description>Set threshold to 1.60 V</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V165</name>
                  <description>Set threshold to 1.65 V</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V170</name>
                  <description>Set threshold to 1.70 V</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V175</name>
                  <description>Set threshold to 1.75 V</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>IGNOREDAPCPWRREGMODE</name>
          <description>Ignore DAPCP power mode</description>
          <addressOffset>0x514</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>IGNOREDAPCPWRREGMODE</name>
              <description>Ignore power request from debugger</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DoNotIgnore</name>
                  <description>Do not ignore power request form debugger</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ignore</name>
                  <description>Ignore power request from debugger</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RSTVTHTRIM</name>
          <description>Threshold trim, power on reset</description>
          <addressOffset>0x518</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>RSTVTHTRIM</name>
              <description>Threshold trim, power on reset</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>BORLVBATTTRIM</name>
          <description>Threshold trim, brown-out reset for VDDL battery</description>
          <addressOffset>0x51C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>BORLVBATTTRIM</name>
              <description>Threshold trim, brown-out reset for VDDL battery</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>BGREFTRIM</name>
          <description>Master bias bandgap trim</description>
          <addressOffset>0x520</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>BGREFTRIM</name>
              <description>Threshold trim, brown-out reset for VDDL battery</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>FORCEOFFNVM</name>
          <description>Force off NVM supply. See also the internal section in the NVMC chapter.</description>
          <addressOffset>0x548</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>FORCEOFFNVM</name>
              <description>Force off NVM supply. See also the internal section in the NVMC chapter.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>DoNotForceOff</name>
                  <description>Read: Do not force off NVM supply.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ForceOff</name>
                  <description>Read: Force off NVM supply.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>DisableForceOff</name>
                  <description>Write: Do not force off NVM supply.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EnableForceOff</name>
                  <description>Write: Force off NVM supply.</description>
                  <value>0xBADCA81E</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
