adamkondraciuk/nrfx/mdk/nrf5340.svd
        <register>
          <name>ATEPOWER</name>
          <description>Analog test bus control for power modules</description>
          <addressOffset>0x588</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>PDCLAMP</name>
              <description>Enable or disable power-down clamp on analog test bus</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OVCLAMP</name>
              <description>Enable or disable overvoltage clamp on analog test bus</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VREGANAAVDD1V3</name>
              <description>Connect or disconnect VREGANA AVDD_1V3 to analog test bus</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disconnected</name>
                  <description>Disconnect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Connected</name>
                  <description>Connect to ATB0</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VREGMAINVDD0V9</name>
              <description>Connect or disconnect VREGMAIN DVDD_0V9 to analog test bus</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disconnected</name>
                  <description>Disconnect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Connected</name>
                  <description>Connect to ATB0</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VREGMAINAVSS</name>
              <description>Connect or disconnect VREGMAIN AVSS to analog test bus</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disconnected</name>
                  <description>Disconnect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Connected</name>
                  <description>Connect to ATB1</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MBIAS</name>
              <description>Configure connection of master bias generator to analog test bus</description>
              <lsb>5</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disconnected</name>
                  <description>Disconnect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VBG</name>
                  <description>Connect 0.9 V bandgap voltage to ATB0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IBPSR10U</name>
                  <description>Connect 10 uA IBPSR current to ATB1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Both</name>
                  <description>Connect both VBG to ATB0 and IBPSR10U to ATB1</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VREF1V2APP</name>
              <description>Connect or disconnect reference generator for Application flash to analog test bus</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disconnected</name>
                  <description>Disconnect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Connected</name>
                  <description>Connect 0.9 V downscaled reference voltage to ATB0</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RST</name>
              <description>Test signals for the RST analog cell</description>
              <lsb>9</lsb>
              <msb>11</msb>
            </field>
            <field>
              <name>VREGRADIOAVDD1V3</name>
              <description>Connect or disconnect VREGRADIO AVDD1V3 to analog test bus</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disconnected</name>
                  <description>Disconnect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Connected</name>
                  <description>Connect to ATB1</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VREGNETWORKDVDD0V9</name>
              <description>Connect or disconnect VREGRADIO DVDD0V9 to analog test bus</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disconnected</name>
                  <description>Disconnect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Connected</name>
                  <description>Connect to ATB1</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VREGRADIOAVSS</name>
              <description>Connect or disconnect VREGRADIO AVDDSS to analog test bus</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disconnected</name>
                  <description>Disconnect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Connected</name>
                  <description>Connect to ATB1</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VREGHULP</name>
              <description>Connect or disconnect TBD  to analog test bus</description>
              <lsb>15</lsb>
              <msb>16</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disconnected</name>
                  <description>Disconnect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Connected</name>
                  <description>Connect to ATB1</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VREGHLDO</name>
              <description>Connect or disconnect TBD  to analog test bus</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disconnected</name>
                  <description>Disconnect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Connected</name>
                  <description>Connect to ATB1</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VREGHBUCK</name>
              <description>Connect or disconnect VREGRADIO DVDD0V9 to analog test bus</description>
              <lsb>18</lsb>
              <msb>19</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disconnected</name>
                  <description>Disconnect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Connected</name>
                  <description>Connect to ATB1</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VREGMAINULP</name>
              <description>Connect or disconnect TBD  to analog test bus</description>
              <lsb>20</lsb>
              <msb>21</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disconnected</name>
                  <description>Disconnect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Connected</name>
                  <description>Connect to ATB1</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VREGRADIOBUCK</name>
              <description>Connect or disconnect TBD to analog test bus</description>
              <lsb>22</lsb>
              <msb>24</msb>
            </field>
            <field>
              <name>VREF1V2NET</name>
              <description>Connect or disconnect reference generator for Network flash to analog test bus</description>
              <lsb>25</lsb>
              <msb>25</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disconnected</name>
                  <description>Disconnect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Connected</name>
                  <description>Connect 0.9 V downscaled reference voltage to ATB0</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <cluster>
          <name>VREGMAIN</name>
          <description>Unspecified</description>
          <headerStructName>REGULATORS_VREGMAIN</headerStructName>
          <addressOffset>0x700</addressOffset>
          <register>
            <name>VOUT</name>
            <description>Control the output voltage for DVDD_1V3</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>VOUT</name>
                <description>Output voltage</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>00</name>
                    <description>1.0 V</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>01</name>
                    <description>1.09 V</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>10</name>
                    <description>1.17 V (default) - should be adjusted to  1.20</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>11</name>
                    <description>1.26 V</description>
                    <value>3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>DCDCEN</name>
            <description>DC/DC enable register for main regulator.</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>DCDCEN</name>
                <description>Enable or disable DC/DC converter</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disable</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Enable</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>FORCEREGMODE</name>
            <description>3-bit backdoor register for manual selection of power mode</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>FORCEREGMODE</name>
                <description>Force Regulator Mode to value</description>
                <lsb>0</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>EXT</name>
                    <description>Force external (DVDD_0V9 supplied externally)</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ULP</name>
                    <description>Force ULP mode</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LDO</name>
                    <description>Force LDO mode</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DCDC</name>
                    <description>Force DCDC mode</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DCDC_REFRESH</name>
                    <description>Force DCDC REFRESH mode</description>
                    <value>4</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>PWRREGTHRESHOLD</name>
            <description>Set threshold value of power regulator</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>PWRREGTHRESHOLD</name>
                <description>Sets the threshold value of power regulator.</description>
                <lsb>0</lsb>
                <msb>6</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>ENFORCEPWRREGMODE</name>
            <description>Enable forcing of power mode in power regulator</description>
            <addressOffset>0x010</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>ENFORCEPWRREGMODE</name>
                <description>Enable forcing of power mode in power regulator</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Pwr regulator forcing off</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Pwr regulator mode forced to value given by FORCEREGMODE</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>CURRENTPWRREGMODE</name>
            <description>Current mode in the power regulator</description>
            <addressOffset>0x014</addressOffset>
            <access>read-only</access>
            <fields>
              <field>
                <name>CURRENTPWRREGMODE</name>
                <description>Current mode in the power regulator</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DISABLEHSLIMIT</name>
            <description>Disable HSLIMIT</description>
            <addressOffset>0x018</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>DISABLE</name>
                <description>Enable or disable HSLIMIT for DCDC regulator</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Enable HSLIMIT</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disable HSLIMIT</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>LDOTESTLOAD</name>
            <description>Test load setting for VREGMAIN</description>
            <addressOffset>0x01C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>VREGLOAD</name>
                <description>Output load configuration (for test purposes)</description>
                <lsb>0</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NormalOperation</name>
                    <description>Normal operation (default)</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>1mATestLoad</name>
                    <description>1mA test load</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>50mATestLoad</name>
                    <description>50mA test load</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>150mATestLoad</name>
                    <description>150mA test load</description>
                    <value>3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>LDOCAL</name>
            <description>Calibration register for the VREGMAIN LDO regulator.</description>
            <addressOffset>0x020</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>VREGTRIM</name>
                <description>Output voltage calibration.</description>
                <lsb>0</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>011</name>
                    <description>1.163 V</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>010</name>
                    <description>1.136 V</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>001</name>
                    <description>1.108 V</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>000</name>
                    <description>1.082 V</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>111</name>
                    <description>1.054 V</description>
                    <value>7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>110</name>
                    <description>1.029 V</description>
                    <value>6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>101</name>
                    <description>1.003 V</description>
                    <value>5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>100</name>
                    <description>0.980 V</description>
                    <value>4</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
