adamkondraciuk/nrfx/mdk/nrf5340.svd
          <register>
            <name>VREGHIGH</name>
            <description>Increase voltage to AVDD_1V3 levels for VREGMAIN  LDO regulator</description>
            <addressOffset>0x028</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>ENABLE</name>
                <description>Enable or disable the feature</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Nominal output levels of VREGMAIN LDO</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Increased output levels of VREGMAIN LDO</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>BUCKCAL</name>
            <description>Calibration register for VREGMAIN DCDC regulator.</description>
            <addressOffset>0x030</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>BUCK_CAL</name>
                <description>Output voltage calibration. 0: Minimum output voltage level. 31: Maximum output voltage level.</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>BUCKCKSEL</name>
            <description>Input clock selection for VREGMAIN DCDC regulator.</description>
            <addressOffset>0x034</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>BUCKCKSEL</name>
                <description>Input clock selection.</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NORMAL</name>
                    <description>normal clock</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>INVERTED</name>
                    <description>inverted clock</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>BUCKDROUTSEL</name>
            <description>Pre-driver speed control</description>
            <addressOffset>0x038</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>BUCKDROUTSEL</name>
                <description>0: Minimum driver speed, low efficiency, low noise. 7: Medium driver speed, medium efficiency, medium noise. 15: Maximum driver speed, high efficiency, high noise.</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>ULPDVDDSELREF</name>
            <description>Select DVDD0V9 reference</description>
            <addressOffset>0x03C</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>ULPDVDDSELREF</name>
                <description>Output voltage calibration. 0: 0.75V ratio of AVDD1V3 output (default) 1: 0.75V reference 2: AVDD1V3 as reference. 3: Reserved for future use.</description>
                <lsb>0</lsb>
                <msb>1</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>ULPRESCTRL</name>
            <description>Switched resistor control</description>
            <addressOffset>0x040</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>ULPRESCTRL</name>
                <description>Output voltage calibration. 0: switched with internal oscillator (default). 1: switched with CLK2K input 2: force always on. 3: force off (PWRUPs must be 0 otherwise default).</description>
                <lsb>0</lsb>
                <msb>1</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>ULPICTRL</name>
            <description>Adjusts current in reference (production calibrated)</description>
            <addressOffset>0x044</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>ULPICTRL</name>
                <description>0: minimum current. 7: default. 15: maximum current.</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>VCORECTRL</name>
            <description>Spare digital signals</description>
            <addressOffset>0x048</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>VCORECTRL</name>
                <description>TBD</description>
                <lsb>0</lsb>
                <msb>1</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>VCORECALIBVCO</name>
            <description>Internal oscillator calibration word</description>
            <addressOffset>0x04C</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>VCORECALIBVCO</name>
                <description>0: Low output frequency. 15: Default output frequency. 31: High output frequency.</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>VREGANA</name>
          <description>Unspecified</description>
          <headerStructName>REGULATORS_VREGANA</headerStructName>
          <addressOffset>0x800</addressOffset>
          <register>
            <name>FORCEREGMODE</name>
            <description>3-bit backdoor register for manual selection of power mode</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>FORCEREGMODE</name>
                <description>Force Regulator Mode to value</description>
                <lsb>0</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>EXT</name>
                    <description>Force external (DVDD_0V9 supplied externally)</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ULP</name>
                    <description>Force ULP mode</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LDO</name>
                    <description>Force LDO mode</description>
                    <value>2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>ENFORCEPWRREGMODE</name>
            <description>Enable forcing of power mode in power regulator</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>ENFORCEPWRREGMODE</name>
                <description>Enable forcing of power mode in power regulator</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Pwr regulator forcing off</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Pwr regulator mode forced to value given by FORCEREGMODE</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>CURRENTPWRREGMODE</name>
            <description>Current mode in the power regulator</description>
            <addressOffset>0x008</addressOffset>
            <access>read-only</access>
            <fields>
              <field>
                <name>CURRENTPWRREGMODE</name>
                <description>Current mode in the power regulator</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DISABLEHSLIMIT</name>
            <description>Disable HSLIMIT</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>DISABLE</name>
                <description>Enable or disable HSLIMIT</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Enable HSLIMIT</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disable HSLIMIT</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>LDOTESTLOAD</name>
            <description>Test load setting for VREGANA.</description>
            <addressOffset>0x010</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>VREGLOAD</name>
                <description>Output load configuration (for test purposes)</description>
                <lsb>0</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NormalOperation</name>
                    <description>Normal operation (default)</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>1mATestLoad</name>
                    <description>1mA test load</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>50mATestLoad</name>
                    <description>50mA test load</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>150mATestLoad</name>
                    <description>150mA test load</description>
                    <value>3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>LDOCAL</name>
            <description>Configuration register for the VREGANA LDO regulator.</description>
            <addressOffset>0x014</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>VREGTRIM</name>
                <description>Output voltage calibration.</description>
                <lsb>0</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>011</name>
                    <description>1.357 V</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>010</name>
                    <description>1.324 V</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>001</name>
                    <description>1.289 V</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>000</name>
                    <description>1.255 V</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>111</name>
                    <description>1.219 V</description>
                    <value>7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>110</name>
                    <description>1.185 V</description>
                    <value>6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>101</name>
                    <description>1.150 V</description>
                    <value>5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>100</name>
                    <description>1.170 V</description>
                    <value>4</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>ULPCAL</name>
            <description>Calibration  register for VREGANA ULP regulator .</description>
            <addressOffset>0x018</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>ULPTRIM</name>
                <description>Output voltage calibration. 0: minimum voltage 31: maximum voltage</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>VREGRADIO</name>
          <description>Unspecified</description>
          <headerStructName>REGULATORS_VREGRADIO</headerStructName>
          <addressOffset>0x900</addressOffset>
          <register>
            <name>VOUT</name>
            <description>Control the output voltage for RVDD_1V3 Note: This is overridden by VOUTREQH when VREQH is requested by the network MCU.</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>VOUT</name>
                <description>Output voltage</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>00</name>
                    <description>1.0 V</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>01</name>
                    <description>1.09 V</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>10</name>
                    <description>1.18 V</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>11</name>
                    <description>1.27 V</description>
                    <value>3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>DCDCEN</name>
            <description>DC/DC enable register for VREGRADIO</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>DCDCEN</name>
                <description>Enable or disable DC/DC converter</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disable</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Enable</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>ENFORCEPWRREGMODE</name>
            <description>Enable forcing of power mode in power regulator</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>ENFORCEPWRREGMODE</name>
                <description>Enable forcing of power mode in power regulator</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Pwr regulator forcing off</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Pwr regulator mode forced to value given by FORCEREGMODE</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>FORCEREGMODE</name>
            <description>3-bit backdoor register for manual selection of power mode</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>FORCEREGMODE</name>
                <description>Force Regulator Mode to value</description>
                <lsb>0</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Ext</name>
                    <description>Forceo external</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ULP</name>
                    <description>Force ULP mode</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LDO</name>
                    <description>Force LDO mode</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DCDC</name>
                    <description>Force DCDC mode</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>REF</name>
                    <description>Force REF mode</description>
                    <value>4</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>CURRENTPWRREGMODE</name>
            <description>Current mode in the power regulator</description>
            <addressOffset>0x010</addressOffset>
            <access>read-only</access>
            <fields>
              <field>
                <name>CURRENTPWRREGMODE</name>
                <description>Current mode in the power regulator</description>
                <lsb>0</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Ext</name>
                    <description>External</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DCDC</name>
                    <description>DCDC</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>REF</name>
                    <description>REF</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LDO</name>
                    <description>ULP DCDC</description>
                    <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LDO_DCDC</name>
                    <description>LDO DCDC</description>
                    <value>6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LDO_REF</name>
                    <description>LDO REF</description>
                    <value>7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ULP</name>
                    <description>ULP</description>
                    <value>8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DCDC_ULP</name>
                    <description>ULP DCDC</description>
                    <value>10</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>REF_ULP</name>
                    <description>REF ULP</description>
                    <value>11</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ULP_LDO</name>
                    <description>ULP DCDC</description>
                    <value>12</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>TESTLOAD</name>
            <description>Test load setting for VREGRADIO.</description>
            <addressOffset>0x014</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>TESTLOAD</name>
                <description>Output load configuration (for test purposes)</description>
                <lsb>0</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NormalOperation</name>
                    <description>Normal operation (default)</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>1mATestLoad</name>
                    <description>1mA test load</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>20mATestLoad</name>
                    <description>20mA test load</description>
                    <value>2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
