adamkondraciuk/nrfx/mdk/nrf5340.svd
          <register>
            <name>ULPCAL</name>
            <description>Calibration  VREGRADIO ULP regulator</description>
            <addressOffset>0x018</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>CAL</name>
                <description>Calibration value</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUG</name>
            <description>Debug register - Control spare signals in POWER_LVLP</description>
            <addressOffset>0x01C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>DEBUG</name>
                <description>Connected to POWER_LVLP_DEBUG_0V9[12:0]</description>
                <lsb>0</lsb>
                <msb>13</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>VOUTREQH</name>
            <description>Control the output voltage for RVDD_1V3 when VREQH is asserted. VREQH can be asserted through the network MCU.</description>
            <addressOffset>0x020</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>VOUT</name>
                <description>Output voltage</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>00</name>
                    <description>1.0 V</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>01</name>
                    <description>1.09 V</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>10</name>
                    <description>1.18 V</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>11</name>
                    <description>1.27 V</description>
                    <value>3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>BUCKCALMAXILIM</name>
            <description>TBD</description>
            <addressOffset>0x024</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>CALMAXILIM</name>
                <description>TBD</description>
                <lsb>0</lsb>
                <msb>1</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>BUCKCALPWM</name>
            <description>TBD</description>
            <addressOffset>0x028</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>CALPWM</name>
                <description>TBD</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>BUCKPFMEN</name>
            <description>PFM enable register for VREGRADIO regulator</description>
            <addressOffset>0x02C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>PFMEN</name>
                <description>Enable or disable PFM in VREGRADIO regulator</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disable PFM (default)</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Enable PFM</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>BUCKPFMCAL</name>
            <description>TBD</description>
            <addressOffset>0x030</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>PFMCAL</name>
                <description>TBD</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>BUCKPFMICMPCAL</name>
            <description>TBD</description>
            <addressOffset>0x034</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>PFMICMPCAL</name>
                <description>TBD</description>
                <lsb>0</lsb>
                <msb>2</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>BUCKPFMICMPCOUNT</name>
            <description>TBD</description>
            <addressOffset>0x038</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>PFMICMPCOUNT</name>
                <description>TBD</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PWRREGTHRESHOLD</name>
            <description>Set threshold value of power regulator</description>
            <addressOffset>0x03C</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>PWRREGTHRESHOLD</name>
                <description>Sets the threshold value of power regulator.</description>
                <lsb>0</lsb>
                <msb>6</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>VREGNETWORK</name>
          <description>Unspecified</description>
          <headerStructName>REGULATORS_VREGNETWORK</headerStructName>
          <addressOffset>0xA00</addressOffset>
          <register>
            <name>VOUT</name>
            <description>Control the output voltage for DVDD_0V9</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>VOUT</name>
                <description>Output voltage</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>ULPALWAYSON</name>
            <description>Keep DVDD_0V9 ULP regulator on at all times</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000001</resetValue>
            <fields>
              <field>
                <name>ULPALWAYSON</name>
                <description>ULP always on</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>DVDD_0V9 ULP regulator turned off in LDO modes</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>DVDD_0V9 ULP regulator always on</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>ENFORCEPWRREGMODE</name>
            <description>Enable forcing of power mode in power regulator</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>ENFORCEPWRREGMODE</name>
                <description>Enable forcing of power mode in power regulator</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Pwr regulator forcing off</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Pwr regulator mode forced to value given by FORCEREGMODE</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>FORCEREGMODE</name>
            <description>3-bit backdoor register for manual selection of power mode</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>FORCEREGMODE</name>
                <description>Force Regulator Mode to value</description>
                <lsb>0</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Ext</name>
                    <description>Forceo external</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ULP</name>
                    <description>Force ULP mode</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LDO</name>
                    <description>Force LDO mode</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DCDC</name>
                    <description>Force DCDC mode</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>REF</name>
                    <description>Force REF mode</description>
                    <value>4</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>CURRENTPWRREGMODE</name>
            <description>Current mode in the power regulator</description>
            <addressOffset>0x010</addressOffset>
            <access>read-only</access>
            <fields>
              <field>
                <name>CURRENTPWRREGMODE</name>
                <description>Current mode in the power regulator</description>
                <lsb>0</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Ext</name>
                    <description>External</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DCDC</name>
                    <description>DCDC</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>REF</name>
                    <description>REF</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LDO</name>
                    <description>ULP DCDC</description>
                    <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LDO_DCDC</name>
                    <description>LDO DCDC</description>
                    <value>6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LDO_REF</name>
                    <description>LDO REF</description>
                    <value>7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ULP</name>
                    <description>ULP</description>
                    <value>8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DCDC_ULP</name>
                    <description>ULP DCDC</description>
                    <value>10</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>REF_ULP</name>
                    <description>REF ULP</description>
                    <value>11</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ULP_LDO</name>
                    <description>ULP DCDC</description>
                    <value>12</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>PWRREGICMPTIMER</name>
            <description>Control the stay-alive time for the VREGNETWORK current comparator</description>
            <addressOffset>0x014</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>COUNT</name>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TESTLOAD</name>
            <description>Test load setting for VREGNETWORK.</description>
            <addressOffset>0x018</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>TESTLOAD</name>
                <description>Output load configuration (for test purposes)</description>
                <lsb>0</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NormalOperation</name>
                    <description>Normal operation (default)</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>1mATestLoad</name>
                    <description>1mA test load</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>20mATestLoad</name>
                    <description>20mA test load</description>
                    <value>2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>ULPCAL</name>
            <description>Calibration  VREGNETWORK ULP regulator</description>
            <addressOffset>0x020</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>CAL</name>
                <description>Calibration value</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>ULPICMPCAL</name>
            <description>Calibration of current comparator on DVDD_0V9 ULP regulator</description>
            <addressOffset>0x024</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>CAL</name>
                <lsb>0</lsb>
                <msb>2</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>BYPASS</name>
            <description>Bypass control for VREGNETWORK</description>
            <addressOffset>0x028</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>CAL</name>
                <description>Bypass control</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NormalMode</name>
                    <description>Normal operation (default)</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>BypassMode</name>
                    <description>Output voltage is 30mV lower than input voltage</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>VREGH</name>
          <description>Unspecified</description>
          <headerStructName>REGULATORS_VREGH</headerStructName>
          <addressOffset>0xC00</addressOffset>
          <register>
            <name>DCDCEN</name>
            <description>DC/DC enable register for VREGH.</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>DCDCEN</name>
                <description>Enable or disable DC/DC converter</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disable</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Enable</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>BUCKCAL</name>
            <description>BUCK_VIO output voltage fine calibration</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>BUCKCAL</name>
                <description>BUCK_VIO output voltage fine calibration - connected to  BUCKVIO_CAL_0V9[4:0]</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>ULPICMPTRIM</name>
            <description>Trimming of VREG_VIO_ULP load current measurement</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>ULPICMPTRIM</name>
                <description>Trimming of VREG_VIO_ULP load current measurement</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>m30pcnt</name>
                    <description>-30 percent</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>m10pcnt</name>
                    <description>-10 percent (default)</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>p10pcnt</name>
                    <description>+10 percent</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>p30pcnt</name>
                    <description>+30 percent</description>
                    <value>3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>VREGICMPTRIM</name>
            <description>Trimming of VREG_VIO load current measurement</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>VREGICMPTRIM</name>
                <description>Trimming of VREG_VIO load current measurement</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>m30pcnt</name>
                    <description>-30 percent</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>m10pcnt</name>
                    <description>-10 percent (default)</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>p10pcnt</name>
                    <description>+10 percent</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>p30pcnt</name>
                    <description>+30 percent</description>
                    <value>3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>BUCKCALILIM</name>
            <description>BUCK_VIO output current limit calibration</description>
            <addressOffset>0x010</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>BUCKCALILIM</name>
                <description>BUCK_VIO output current limit calibration</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>65mA</name>
                    <description>65mA (default)</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>m20pcnt</name>
                    <description>-20 percent</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>p40pcnt</name>
                    <description>+40 percent</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>p20pcnt</name>
                    <description>+20 percent</description>
                    <value>3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
