adamkondraciuk/nrfx/mdk/nrf5340.svd
          <register>
            <name>EXTSUPPLY</name>
            <description>Enable external circuitry to be supplied from VDD pin).</description>
            <addressOffset>0x014</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000001</resetValue>
            <fields>
              <field>
                <name>EXTSUPPLY</name>
                <description>Shadow register for corresponding register in UICR. Enable external circuitry to be supplied from VDD pin (output of REG0 stage). Applicable in 'High voltage mode' only.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>No current can be drawn from the VDD pin.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>It is allowed to supply external circuitry from the VDD pin.</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RFSHBUCKCAL</name>
            <description>Refresh mode trim register</description>
            <addressOffset>0x018</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>RFSHBUCKCAL</name>
                <description>Refresh mode trim register</description>
                <lsb>0</lsb>
                <msb>1</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>RFSHTRIMULP</name>
            <description>Trimmed value for refresh mode counter for automatic mode change to ULP</description>
            <addressOffset>0x01C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>RFSHTRIMULP</name>
                <description>Trimmed value for refresh mode counter for automatic mode change to ULP</description>
                <lsb>0</lsb>
                <msb>5</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>RFSHTRIMPWM</name>
            <description>Trimmed value for refresh mode counter for automatic mode change to PWM</description>
            <addressOffset>0x020</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>RFSHTRIMPWM</name>
                <description>Trimmed value for refresh mode counter for automatic mode change to PWM</description>
                <lsb>0</lsb>
                <msb>5</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>RFSHPOLLSEL</name>
            <description>Programmable value for counter for poller in PWM mode</description>
            <addressOffset>0x024</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>RFSHPOLLSEL</name>
                <description>Programmable value for counter for poller in PWM mode</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>256us</name>
                    <description>256 us polling interval</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>512us</name>
                    <description>512 us polling interval</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>1024us</name>
                    <description>1024 us polling interval</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disabled</description>
                    <value>3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>BUCKCKDIV2</name>
            <description>Sets BUCK_VIO switching frequency</description>
            <addressOffset>0x028</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>BUCKCKDIV2</name>
                <description>Sets BUCK_VIO switching frequency</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>8MHz</name>
                    <description>8 MHz</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>4MHz</name>
                    <description>4 MHz</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>POWERCFG</name>
            <description>Spare configuration signals for POWER_VIO</description>
            <addressOffset>0x02C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>POWERCFG</name>
                <description>Spare configuration signals for POWER_VIO</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LDO2ULPOVERLAPTRIM</name>
            <description>Programmable value for VREGH ldo to ulp overlay counter</description>
            <addressOffset>0x030</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>LDO2ULPOVERLAPTRIM</name>
                <description>Programmable value for VREGH LDO to ULP overlay counter. Value loaded from FICR-&amp;gt;CHIPCONF06.LDOTOULPOVERLAPTRIM</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>512us</name>
                    <description>512 us overlay</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>1024us</name>
                    <description>1024 us overlay</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>ULPDISABLE</name>
            <description>VREGH ULP mode</description>
            <addressOffset>0x034</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>ULPDISABLE</name>
                <description>VREGH ULP mode</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Auto</name>
                    <description>ULP mode is allowed</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>ULP mode is not allowed</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>CURRENTPWRREGMODE</name>
            <description>Current mode in the VREGH  power regulator</description>
            <addressOffset>0x038</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>CURRENTPWRREGMODE</name>
                <description>Current mode in the VREGH  power regulator</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>VDDHDETECTED</name>
            <description>Vddh is detected</description>
            <addressOffset>0x03C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>VDDHDETECTED</name>
                <description>Vddh is detected</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotPresent</name>
                    <description>Vddh not detected</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Present</name>
                    <description>Vddh detected</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>EXTSILENTEN</name>
            <description>Enable 'silent' external DCDC supply. This register only applies when DCDC is enabled in the VREGHDCDCEN register. Entering 'silent mode' forbids the use of DCDC refresh mode internally in VREGH.</description>
            <addressOffset>0x040</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>EXTSILENTEN</name>
                <description>Enable 'silent' external DCDC supply.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disable</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Enable</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>ENFORCEPWRREGMODE</name>
            <description>Enable forcing of power mode in power regulator</description>
            <addressOffset>0x044</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>ENFORCEPWRREGMODE</name>
                <description>Enable forcing of power mode in power regulator</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Pwr regulator forcing off</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Pwr regulator mode forced to value given by FORCEREGMODE</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>FORCEREGMODE</name>
            <description>Force a specific  power mode for VREGH</description>
            <addressOffset>0x048</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>FORCEPWRREGMODE</name>
                <description>Force a specific  power mode</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PWRREGTHRESHOLD</name>
            <description>Set threshold value of power regulator</description>
            <addressOffset>0x04C</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>PWRREGTHRESHOLD</name>
                <description>Sets the threshold value of power regulator.</description>
                <lsb>0</lsb>
                <msb>6</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>DISABLEPACSYSTEMOFFACK</name>
          <description>Enable or disable System OFF ack from PAC</description>
          <addressOffset>0xEE4</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DISABLE</name>
              <description>Enable or disable System OFF ack from PAC</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable ack</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable ack</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DISABLESRAMSYSTEMOFFACK</name>
          <description>Enable or disable System OFF ack from SRAM</description>
          <addressOffset>0xEE8</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DISABLE</name>
              <description>Enable or disable System OFF ack from SRAM</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable ack</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable ack</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DISABLENVMSYSTEMOFFACK</name>
          <description>Enable or disable System OFF ack from NVM</description>
          <addressOffset>0xEEC</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DISABLE</name>
              <description>Enable or disable System OFF ack from NVM</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable ack</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable ack</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
