adamkondraciuk/nrfx/mdk/nrf5340.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="CLOCK_NS">
      <name>CLOCK_S</name>
      <description>Clock Management 1</description>
      <baseAddress>0x50005000</baseAddress>
      <!--Security dma=NSA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>POWER_CLOCK</name>
        <value>5</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="POWER_NS">
      <name>POWER_S</name>
      <description>Power Control 1</description>
      <baseAddress>0x50005000</baseAddress>
      <alternatePeripheral>CLOCK_S</alternatePeripheral>
      <!--Security dma=NSA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>POWER_CLOCK</name>
        <value>5</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="RESET_NS">
      <name>RESET_S</name>
      <description>Reset Control 1</description>
      <baseAddress>0x50005000</baseAddress>
      <alternatePeripheral>CLOCK_S</alternatePeripheral>
      <!--Security dma=NSA-->
      <!--Security securemapping=US-->
    </peripheral>
    <peripheral>
      <name>CTRLAP_NS</name>
      <description>Control access port 0</description>
      <baseAddress>0x40006000</baseAddress>
      <headerStructName>CTRLAPPERI</headerStructName>
      <!--Security dma=NSA-->
      <!--Security securemapping=US-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>CTRLAPPERI</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>CTRLDAP2COREDATA</name>
          <description>Data sent from the Debugger to the Core</description>
          <addressOffset>0x400</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DATA</name>
              <description>General Data</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRLDAP2CORESTATUS</name>
          <description>Status to indicate if Data sent from the Debugger to the Core has been read</description>
          <addressOffset>0x404</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>STATUS</name>
              <description>Status of data in CTRLDAP2COREDATA register</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NoDataPending</name>
                  <description>No data pending in CTRLDAP2COREDATA</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DataPending</name>
                  <description>Data pending in CTRLDAP2COREDATA</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE2CTRLDAPDATA</name>
          <description>Data sent from the Core to the Debugger</description>
          <addressOffset>0x480</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DATA</name>
              <description>General Data</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE2CTRLDAPSTATUS</name>
          <description>Status to indicate if Data sent from the Core to the Debugger status has been read</description>
          <addressOffset>0x484</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>STATUS</name>
              <description>Status of data in CORE2CTRLDAPDATA register</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NoDataPending</name>
                  <description>No data pending in CTRLDAP2COREDATA</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DataPending</name>
                  <description>Data pending in CTRLDAP2COREDATA</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CPURETURNFIELD_LOCK</name>
          <description>Lock Mail Box erase all mechanism</description>
          <addressOffset>0x500</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LOCK</name>
              <description>Enable or disable the erase all mechanism for return field case. A write once register.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Eraseall for return field can be issued</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Eraseall for return field is locked</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CPURETURNFIELD</name>
          <description>Mail box erase all control register. A write once register.</description>
          <addressOffset>0x504</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>STATUS</name>
              <description>Random value to generate a eraseall for return field case.</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
