adamkondraciuk/nrfx/mdk/nrf5340.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="CTRLAP_NS">
      <name>CTRLAP_S</name>
      <description>Control access port 1</description>
      <baseAddress>0x50006000</baseAddress>
      <!--Security dma=NSA-->
      <!--Security securemapping=US-->
    </peripheral>
    <peripheral>
      <name>PAMLI_NS</name>
      <description>Peripheral AHB Multi-Layer Interface 0</description>
      <baseAddress>0x40007000</baseAddress>
      <headerStructName>PAMLI</headerStructName>
      <!--Security dma=NSA-->
      <!--Security securemapping=US-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>PAMLI</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>BRIDGETYPE</name>
          <description>Select AHB2AHB Sync Bridge Type</description>
          <addressOffset>0x5A0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000003</resetValue>
          <fields>
            <field>
              <name>RADIO</name>
              <description>Select bridge type for RADIO</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Default</name>
                  <description>Select standard ARM bridge</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Nordic</name>
                  <description>Select Nordic bridge</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CRYPTO</name>
              <description>Select bridge type for CCM, ECB, AAR</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Default</name>
                  <description>Select standard ARM bridge</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Nordic</name>
                  <description>Select Nordic bridge</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <cluster>
          <name>RAMPRI</name>
          <description>RAM configurable priority configuration structure</description>
          <headerStructName>PAMLI_RAMPRI</headerStructName>
          <addressOffset>0xE00</addressOffset>
          <register>
            <name>SERIAL0</name>
            <description>AHB bus master priority register for SPIM0, SPIS0, TWIM0, TWIS0 and UARTE0</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>RAM0</name>
                <description>Priority register for RAM AHB slave 0</description>
                <lsb>0</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Pri0</name>
                    <description>Priority 0</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri1</name>
                    <description>Priority 1</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri2</name>
                    <description>Priority 2</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri3</name>
                    <description>Priority 3</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri4</name>
                    <description>Priority 4</description>
                    <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri5</name>
                    <description>Priority 5</description>
                    <value>5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri6</name>
                    <description>Priority 6</description>
                    <value>6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri7</name>
                    <description>Priority 7</description>
                    <value>7</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RAM1</name>
                <description>Priority register for RAM AHB slave 1</description>
                <lsb>4</lsb>
                <msb>7</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Pri0</name>
                    <description>Priority 0</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri1</name>
                    <description>Priority 1</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri2</name>
                    <description>Priority 2</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri3</name>
                    <description>Priority 3</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri4</name>
                    <description>Priority 4</description>
                    <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri5</name>
                    <description>Priority 5</description>
                    <value>5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri6</name>
                    <description>Priority 6</description>
                    <value>6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri7</name>
                    <description>Priority 7</description>
                    <value>7</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RAM2</name>
                <description>Priority register for RAM AHB slave 2</description>
                <lsb>8</lsb>
                <msb>11</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Pri0</name>
                    <description>Priority 0</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri1</name>
                    <description>Priority 1</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri2</name>
                    <description>Priority 2</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri3</name>
                    <description>Priority 3</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri4</name>
                    <description>Priority 4</description>
                    <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri5</name>
                    <description>Priority 5</description>
                    <value>5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri6</name>
                    <description>Priority 6</description>
                    <value>6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri7</name>
                    <description>Priority 7</description>
                    <value>7</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RAM3</name>
                <description>Priority register for RAM AHB slave 3</description>
                <lsb>12</lsb>
                <msb>15</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Pri0</name>
                    <description>Priority 0</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri1</name>
                    <description>Priority 1</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri2</name>
                    <description>Priority 2</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri3</name>
                    <description>Priority 3</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri4</name>
                    <description>Priority 4</description>
                    <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri5</name>
                    <description>Priority 5</description>
                    <value>5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri6</name>
                    <description>Priority 6</description>
                    <value>6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri7</name>
                    <description>Priority 7</description>
                    <value>7</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RAM4</name>
                <description>Priority register for RAM AHB slave 4</description>
                <lsb>16</lsb>
                <msb>19</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Pri0</name>
                    <description>Priority 0</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri1</name>
                    <description>Priority 1</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri2</name>
                    <description>Priority 2</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri3</name>
                    <description>Priority 3</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri4</name>
                    <description>Priority 4</description>
                    <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri5</name>
                    <description>Priority 5</description>
                    <value>5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri6</name>
                    <description>Priority 6</description>
                    <value>6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri7</name>
                    <description>Priority 7</description>
                    <value>7</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RAM5</name>
                <description>Priority register for RAM AHB slave 5</description>
                <lsb>20</lsb>
                <msb>23</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Pri0</name>
                    <description>Priority 0</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri1</name>
                    <description>Priority 1</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri2</name>
                    <description>Priority 2</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri3</name>
                    <description>Priority 3</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri4</name>
                    <description>Priority 4</description>
                    <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri5</name>
                    <description>Priority 5</description>
                    <value>5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri6</name>
                    <description>Priority 6</description>
                    <value>6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri7</name>
                    <description>Priority 7</description>
                    <value>7</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RAM6</name>
                <description>Priority register for RAM AHB slave 6</description>
                <lsb>24</lsb>
                <msb>27</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Pri0</name>
                    <description>Priority 0</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri1</name>
                    <description>Priority 1</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri2</name>
                    <description>Priority 2</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri3</name>
                    <description>Priority 3</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri4</name>
                    <description>Priority 4</description>
                    <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri5</name>
                    <description>Priority 5</description>
                    <value>5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri6</name>
                    <description>Priority 6</description>
                    <value>6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri7</name>
                    <description>Priority 7</description>
                    <value>7</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RAM7</name>
                <description>Priority register for RAM AHB slave 7</description>
                <lsb>28</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Pri0</name>
                    <description>Priority 0</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri1</name>
                    <description>Priority 1</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri2</name>
                    <description>Priority 2</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri3</name>
                    <description>Priority 3</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri4</name>
                    <description>Priority 4</description>
                    <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri5</name>
                    <description>Priority 5</description>
                    <value>5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri6</name>
                    <description>Priority 6</description>
                    <value>6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri7</name>
                    <description>Priority 7</description>
                    <value>7</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
