adamkondraciuk/nrfx/mdk/nrf5340.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="SPIM0_NS">
      <name>SPIM0_S</name>
      <description>Serial Peripheral Interface Master with EasyDMA 1</description>
      <baseAddress>0x50008000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>UARTE0_SPIM0_SPIS0_TWIM0_TWIS0</name>
        <value>8</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="SPIS0_NS">
      <name>SPIS0_S</name>
      <description>SPI Slave 1</description>
      <baseAddress>0x50008000</baseAddress>
      <alternatePeripheral>SPIM0_S</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>UARTE0_SPIM0_SPIS0_TWIM0_TWIS0</name>
        <value>8</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="TWIM0_NS">
      <name>TWIM0_S</name>
      <description>I2C compatible Two-Wire Master Interface with EasyDMA 1</description>
      <baseAddress>0x50008000</baseAddress>
      <alternatePeripheral>SPIM0_S</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>UARTE0_SPIM0_SPIS0_TWIM0_TWIS0</name>
        <value>8</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="TWIS0_NS">
      <name>TWIS0_S</name>
      <description>I2C compatible Two-Wire Slave Interface with EasyDMA 1</description>
      <baseAddress>0x50008000</baseAddress>
      <alternatePeripheral>SPIM0_S</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>UARTE0_SPIM0_SPIS0_TWIM0_TWIS0</name>
        <value>8</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="UARTE0_NS">
      <name>UARTE0_S</name>
      <description>UART with EasyDMA 1</description>
      <baseAddress>0x50008000</baseAddress>
      <alternatePeripheral>SPIM0_S</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>UARTE0_SPIM0_SPIS0_TWIM0_TWIS0</name>
        <value>8</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="SPIM0_NS">
      <name>SPIM1_NS</name>
      <description>Serial Peripheral Interface Master with EasyDMA 2</description>
      <baseAddress>0x40009000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>UARTE1_SPIM1_SPIS1_TWIM1_TWIS1</name>
        <value>9</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="SPIS0_NS">
      <name>SPIS1_NS</name>
      <description>SPI Slave 2</description>
      <baseAddress>0x40009000</baseAddress>
      <alternatePeripheral>SPIM1_NS</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>UARTE1_SPIM1_SPIS1_TWIM1_TWIS1</name>
        <value>9</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="TWIM0_NS">
      <name>TWIM1_NS</name>
      <description>I2C compatible Two-Wire Master Interface with EasyDMA 2</description>
      <baseAddress>0x40009000</baseAddress>
      <alternatePeripheral>SPIM1_NS</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>UARTE1_SPIM1_SPIS1_TWIM1_TWIS1</name>
        <value>9</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="TWIS0_NS">
      <name>TWIS1_NS</name>
      <description>I2C compatible Two-Wire Slave Interface with EasyDMA 2</description>
      <baseAddress>0x40009000</baseAddress>
      <alternatePeripheral>SPIM1_NS</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>UARTE1_SPIM1_SPIS1_TWIM1_TWIS1</name>
        <value>9</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="UARTE0_NS">
      <name>UARTE1_NS</name>
      <description>UART with EasyDMA 2</description>
      <baseAddress>0x40009000</baseAddress>
      <alternatePeripheral>SPIM1_NS</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>UARTE1_SPIM1_SPIS1_TWIM1_TWIS1</name>
        <value>9</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="SPIM0_NS">
      <name>SPIM1_S</name>
      <description>Serial Peripheral Interface Master with EasyDMA 3</description>
      <baseAddress>0x50009000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>UARTE1_SPIM1_SPIS1_TWIM1_TWIS1</name>
        <value>9</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="SPIS0_NS">
      <name>SPIS1_S</name>
      <description>SPI Slave 3</description>
      <baseAddress>0x50009000</baseAddress>
      <alternatePeripheral>SPIM1_S</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>UARTE1_SPIM1_SPIS1_TWIM1_TWIS1</name>
        <value>9</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="TWIM0_NS">
      <name>TWIM1_S</name>
      <description>I2C compatible Two-Wire Master Interface with EasyDMA 3</description>
      <baseAddress>0x50009000</baseAddress>
      <alternatePeripheral>SPIM1_S</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>UARTE1_SPIM1_SPIS1_TWIM1_TWIS1</name>
        <value>9</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="TWIS0_NS">
      <name>TWIS1_S</name>
      <description>I2C compatible Two-Wire Slave Interface with EasyDMA 3</description>
      <baseAddress>0x50009000</baseAddress>
      <alternatePeripheral>SPIM1_S</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>UARTE1_SPIM1_SPIS1_TWIM1_TWIS1</name>
        <value>9</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="UARTE0_NS">
      <name>UARTE1_S</name>
      <description>UART with EasyDMA 3</description>
      <baseAddress>0x50009000</baseAddress>
      <alternatePeripheral>SPIM1_S</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>UARTE1_SPIM1_SPIS1_TWIM1_TWIS1</name>
        <value>9</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="SPIM0_NS">
      <name>SPIM2_NS</name>
      <description>Serial Peripheral Interface Master with EasyDMA 4</description>
      <baseAddress>0x4000A000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SPIM2</name>
        <value>10</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="SPIM0_NS">
      <name>SPIM2_S</name>
      <description>Serial Peripheral Interface Master with EasyDMA 5</description>
      <baseAddress>0x5000A000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SPIM2</name>
        <value>10</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>GPIOTE_S_S</name>
      <description>GPIO Tasks and Events 0</description>
      <baseAddress>0x5000D000</baseAddress>
      <headerStructName>GPIOTE</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>GPIOTE_S</name>
        <value>13</value>
      </interrupt>
      <groupName>GPIOTE</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <dim>0x8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>TASKS_OUT[%s]</name>
          <description>Description collection: Task for writing to pin specified in CONFIG[n].PSEL. Action on pin is configured in CONFIG[n].POLARITY.</description>
          <addressOffset>0x000</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_OUT</name>
              <description>Task for writing to pin specified in CONFIG[n].PSEL. Action on pin is configured in CONFIG[n].POLARITY.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>TASKS_SET[%s]</name>
          <description>Description collection: Task for writing to pin specified in CONFIG[n].PSEL. Action on pin is to set it high.</description>
          <addressOffset>0x030</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_SET</name>
              <description>Task for writing to pin specified in CONFIG[n].PSEL. Action on pin is to set it high.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>TASKS_CLR[%s]</name>
          <description>Description collection: Task for writing to pin specified in CONFIG[n].PSEL. Action on pin is to set it low.</description>
          <addressOffset>0x060</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_CLR</name>
              <description>Task for writing to pin specified in CONFIG[n].PSEL. Action on pin is to set it low.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>SUBSCRIBE_OUT[%s]</name>
          <description>Description collection: Subscribe configuration for task OUT[n]</description>
          <addressOffset>0x080</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>Channel that task OUT[n] will subscribe to</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable subscription</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable subscription</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>SUBSCRIBE_SET[%s]</name>
          <description>Description collection: Subscribe configuration for task SET[n]</description>
          <addressOffset>0x0B0</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>Channel that task SET[n] will subscribe to</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable subscription</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable subscription</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>SUBSCRIBE_CLR[%s]</name>
          <description>Description collection: Subscribe configuration for task CLR[n]</description>
          <addressOffset>0x0E0</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>Channel that task CLR[n] will subscribe to</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable subscription</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable subscription</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>EVENTS_IN[%s]</name>
          <description>Description collection: Event generated from pin specified in CONFIG[n].PSEL</description>
          <addressOffset>0x100</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_IN</name>
              <description>Event generated from pin specified in CONFIG[n].PSEL</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_PORT</name>
          <description>Event generated from multiple input GPIO pins with SENSE mechanism enabled</description>
          <addressOffset>0x17C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_PORT</name>
              <description>Event generated from multiple input GPIO pins with SENSE mechanism enabled</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>PUBLISH_IN[%s]</name>
          <description>Description collection: Publish configuration for event IN[n]</description>
          <addressOffset>0x180</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>Channel that event IN[n] will publish to.</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable publishing</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable publishing</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBLISH_PORT</name>
          <description>Publish configuration for event PORT</description>
          <addressOffset>0x1FC</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>Channel that event PORT will publish to.</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable publishing</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable publishing</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
