adamkondraciuk/nrfx/mdk/nrf5340.svd
        <register>
          <name>OVERSAMPLE</name>
          <description>Oversampling configuration. OVERSAMPLE should not be combined with SCAN. The RESOLUTION is applied before averaging, thus for high OVERSAMPLE a higher RESOLUTION should be used.</description>
          <addressOffset>0x5F4</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>OVERSAMPLE</name>
              <description>Oversample control</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Bypass</name>
                  <description>Bypass oversampling</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Over2x</name>
                  <description>Oversample 2x</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Over4x</name>
                  <description>Oversample 4x</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Over8x</name>
                  <description>Oversample 8x</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Over16x</name>
                  <description>Oversample 16x</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Over32x</name>
                  <description>Oversample 32x</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Over64x</name>
                  <description>Oversample 64x</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Over128x</name>
                  <description>Oversample 128x</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Over256x</name>
                  <description>Oversample 256x</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Over512x</name>
                  <description>Oversample 512x</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Over1024x</name>
                  <description>Oversample 1024x</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Over2048x</name>
                  <description>Oversample 2048x</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Over4096x</name>
                  <description>Oversample 4096x</description>
                  <value>12</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SAMPLERATE</name>
          <description>Controls normal or continuous sample rate</description>
          <addressOffset>0x5F8</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CC</name>
              <description>Capture and compare value. Sample rate is 16 MHz/CC</description>
              <lsb>0</lsb>
              <msb>10</msb>
            </field>
            <field>
              <name>MODE</name>
              <description>Select mode for sample rate control</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Task</name>
                  <description>Rate is controlled from SAMPLE task</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Timers</name>
                  <description>Rate is controlled from local timer (use CC to control the rate)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <cluster>
          <name>RESULT</name>
          <description>RESULT EasyDMA channel</description>
          <headerStructName>SAADC_RESULT</headerStructName>
          <addressOffset>0x62C</addressOffset>
          <register>
            <name>PTR</name>
            <description>Data pointer</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>PTR</name>
                <description>Data pointer</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>MAXCNT</name>
            <description>Maximum number of buffer words to transfer</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>MAXCNT</name>
                <description>Maximum number of buffer words to transfer</description>
                <lsb>0</lsb>
                <msb>14</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AMOUNT</name>
            <description>Number of buffer words transferred since last START</description>
            <addressOffset>0x008</addressOffset>
            <access>read-only</access>
            <fields>
              <field>
                <name>AMOUNT</name>
                <description>Number of buffer words transferred since last START. This register can be read after an END or STOPPED event.</description>
                <lsb>0</lsb>
                <msb>14</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>TESTCTRL</name>
          <description>Control signals used during test of ADC</description>
          <addressOffset>0x63C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>ICTRL</name>
              <description>Current control, 0 = normal current, higher is higher current</description>
              <lsb>0</lsb>
              <msb>1</msb>
            </field>
            <field>
              <name>SWITCH</name>
              <description>Swap positive and negative input</description>
              <lsb>4</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>SHORT</name>
              <description>Short input. Used to measure offset of ADC.</description>
              <lsb>8</lsb>
              <msb>8</msb>
            </field>
            <field>
              <name>TST</name>
              <description>Test bus for ADC core, see design description for coding</description>
              <lsb>12</lsb>
              <msb>16</msb>
            </field>
            <field>
              <name>ATB</name>
              <description>Analog testbus control</description>
              <lsb>20</lsb>
              <msb>21</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>ATB disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VREF</name>
                  <description>Internal reference on ATB0, buffered reference on ATB1</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENINMUX</name>
              <description>Will enable the input mux in the ADC, so the resistor strings can be connected even when the analog core is powered down</description>
              <lsb>24</lsb>
              <msb>24</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CALOFFSET</name>
          <description>Calibration control for offset error</description>
          <addressOffset>0x640</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CALOFFSET</name>
              <description>Sign-magnitude coding</description>
              <lsb>0</lsb>
              <msb>5</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CALGAIN</name>
          <description>Calibration control for gain error</description>
          <addressOffset>0x644</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000040</resetValue>
          <fields>
            <field>
              <name>CALGAIN</name>
              <description>Offset binary coding</description>
              <lsb>0</lsb>
              <msb>6</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CALVREF</name>
          <description>Calibration control for reference voltage</description>
          <addressOffset>0x648</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000040</resetValue>
          <fields>
            <field>
              <name>CALVREF</name>
              <description>Offset binary coding</description>
              <lsb>0</lsb>
              <msb>6</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>POWER</name>
          <description>Peripheral power control</description>
          <addressOffset>0xFFC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>POWER</name>
              <description>Peripheral power control. The peripheral and its registers will be reset to its initial state by switching the peripheral off and then back on again.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Peripheral is powered off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Peripheral is powered on</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
