adamkondraciuk/nrfx/mdk/nrf5340.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="RTC0_NS">
      <name>RTC0_S</name>
      <description>Real time counter 1</description>
      <baseAddress>0x50014000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>RTC0</name>
        <value>20</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="RTC0_NS">
      <name>RTC1_NS</name>
      <description>Real time counter 2</description>
      <baseAddress>0x40015000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>RTC1</name>
        <value>21</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="RTC0_NS">
      <name>RTC1_S</name>
      <description>Real time counter 3</description>
      <baseAddress>0x50015000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>RTC1</name>
        <value>21</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>DPPIC_NS</name>
      <description>Distributed Programmable Peripheral Interconnect Controller 0</description>
      <baseAddress>0x40017000</baseAddress>
      <headerStructName>DPPIC</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=SPLIT-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>DPPIC</groupName>
      <size>0x20</size>
      <registers>
        <cluster>
          <dim>6</dim>
          <dimIncrement>0x008</dimIncrement>
          <name>TASKS_CHG[%s]</name>
          <description>Channel group tasks</description>
          <headerStructName>DPPIC_TASKS_CHG</headerStructName>
          <addressOffset>0x000</addressOffset>
          <register>
            <name>EN</name>
            <description>Description cluster: Enable channel group n</description>
            <addressOffset>0x000</addressOffset>
            <access>write-only</access>
            <fields>
              <field>
                <name>EN</name>
                <description>Enable channel group n</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Trigger</name>
                    <description>Trigger task</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>DIS</name>
            <description>Description cluster: Disable channel group n</description>
            <addressOffset>0x004</addressOffset>
            <access>write-only</access>
            <fields>
              <field>
                <name>DIS</name>
                <description>Disable channel group n</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Trigger</name>
                    <description>Trigger task</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <dim>6</dim>
          <dimIncrement>0x008</dimIncrement>
          <name>SUBSCRIBE_CHG[%s]</name>
          <description>Subscribe configuration for tasks</description>
          <headerStructName>DPPIC_SUBSCRIBE_CHG</headerStructName>
          <addressOffset>0x080</addressOffset>
          <register>
            <name>EN</name>
            <description>Description cluster: Subscribe configuration for task CHG[n].EN</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>CHIDX</name>
                <description>Channel that task CHG[n].EN will subscribe to</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>EN</name>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disable subscription</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Enable subscription</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>DIS</name>
            <description>Description cluster: Subscribe configuration for task CHG[n].DIS</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>CHIDX</name>
                <description>Channel that task CHG[n].DIS will subscribe to</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>EN</name>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disable subscription</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Enable subscription</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
