adamkondraciuk/nrfx/mdk/nrf5340.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="EGU0_NS">
      <name>EGU0_S</name>
      <description>Event Generator Unit 1</description>
      <baseAddress>0x5001B000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>EGU0</name>
        <value>27</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="EGU0_NS">
      <name>EGU1_NS</name>
      <description>Event Generator Unit 2</description>
      <baseAddress>0x4001C000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>EGU1</name>
        <value>28</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="EGU0_NS">
      <name>EGU1_S</name>
      <description>Event Generator Unit 3</description>
      <baseAddress>0x5001C000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>EGU1</name>
        <value>28</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="EGU0_NS">
      <name>EGU2_NS</name>
      <description>Event Generator Unit 4</description>
      <baseAddress>0x4001D000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>EGU2</name>
        <value>29</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="EGU0_NS">
      <name>EGU2_S</name>
      <description>Event Generator Unit 5</description>
      <baseAddress>0x5001D000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>EGU2</name>
        <value>29</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="EGU0_NS">
      <name>EGU3_NS</name>
      <description>Event Generator Unit 6</description>
      <baseAddress>0x4001E000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>EGU3</name>
        <value>30</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="EGU0_NS">
      <name>EGU3_S</name>
      <description>Event Generator Unit 7</description>
      <baseAddress>0x5001E000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>EGU3</name>
        <value>30</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="EGU0_NS">
      <name>EGU4_NS</name>
      <description>Event Generator Unit 8</description>
      <baseAddress>0x4001F000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>EGU4</name>
        <value>31</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="EGU0_NS">
      <name>EGU4_S</name>
      <description>Event Generator Unit 9</description>
      <baseAddress>0x5001F000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>EGU4</name>
        <value>31</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="EGU0_NS">
      <name>EGU5_NS</name>
      <description>Event Generator Unit 10</description>
      <baseAddress>0x40020000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>EGU5</name>
        <value>32</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="EGU0_NS">
      <name>EGU5_S</name>
      <description>Event Generator Unit 11</description>
      <baseAddress>0x50020000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>EGU5</name>
        <value>32</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>PWM0_NS</name>
      <description>Pulse Width Modulation Unit 0</description>
      <baseAddress>0x40021000</baseAddress>
      <headerStructName>PWM</headerStructName>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>PWM0</name>
        <value>33</value>
      </interrupt>
      <groupName>PWM</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>TASKS_START</name>
          <description>Starts PWM pulse generation with the last loaded values</description>
          <addressOffset>0x000</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_START</name>
              <description>Starts PWM pulse generation with the last loaded values</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_STOP</name>
          <description>Stops PWM pulse generation on all channels at the end of current PWM period, and stops sequence playback</description>
          <addressOffset>0x004</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_STOP</name>
              <description>Stops PWM pulse generation on all channels at the end of current PWM period, and stops sequence playback</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x2</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>TASKS_SEQSTART[%s]</name>
          <description>Description collection: Loads the first PWM value on all enabled channels from sequence n, and starts playing that sequence at the rate defined in SEQ[n]REFRESH and/or DECODER.MODE. Causes PWM generation to start it was not running. Sending a SEQSTART[n] task while a sequence is already playing back will gracefully (i.e. glitch-free) abort that sequence at the earliest opportunity and start sequence n.</description>
          <addressOffset>0x008</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_SEQSTART</name>
              <description>Loads the first PWM value on all enabled channels from sequence n, and starts playing that sequence at the rate defined in SEQ[n]REFRESH and/or DECODER.MODE. Causes PWM generation to start it was not running. Sending a SEQSTART[n] task while a sequence is already playing back will gracefully (i.e. glitch-free) abort that sequence at the earliest opportunity and start sequence n.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_NEXTSTEP</name>
          <description>Steps by one value in the current sequence on all enabled channels if DECODER.MODE=NextStep. Does not cause PWM generation to start it was not running.</description>
          <addressOffset>0x010</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_NEXTSTEP</name>
              <description>Steps by one value in the current sequence on all enabled channels if DECODER.MODE=NextStep. Does not cause PWM generation to start it was not running.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_SEQABORT</name>
          <description>(Gracefully) aborts the playback of the current sequence or the current end delay.</description>
          <addressOffset>0x014</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_SEQABORT</name>
              <description>(Gracefully) aborts the playback of the current sequence or the current end delay.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_START</name>
          <description>Subscribe configuration for task START</description>
          <addressOffset>0x080</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>Channel that task START will subscribe to</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable subscription</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable subscription</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_STOP</name>
          <description>Subscribe configuration for task STOP</description>
          <addressOffset>0x084</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>Channel that task STOP will subscribe to</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable subscription</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable subscription</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x2</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>SUBSCRIBE_SEQSTART[%s]</name>
          <description>Description collection: Subscribe configuration for task SEQSTART[n]</description>
          <addressOffset>0x088</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>Channel that task SEQSTART[n] will subscribe to</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable subscription</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable subscription</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_NEXTSTEP</name>
          <description>Subscribe configuration for task NEXTSTEP</description>
          <addressOffset>0x090</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>Channel that task NEXTSTEP will subscribe to</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable subscription</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable subscription</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_SEQABORT</name>
          <description>Subscribe configuration for task SEQABORT</description>
          <addressOffset>0x094</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>Channel that task SEQABORT will subscribe to</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable subscription</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable subscription</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_STARTED</name>
          <description>Response to START task, emitted when PWM pulses start to get generated</description>
          <addressOffset>0x100</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_STARTED</name>
              <description>Response to START task, emitted when PWM pulses start to get generated</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_STOPPED</name>
          <description>Response to STOP task, emitted when PWM pulses are no longer generated</description>
          <addressOffset>0x104</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_STOPPED</name>
              <description>Response to STOP task, emitted when PWM pulses are no longer generated</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x2</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>EVENTS_SEQSTARTED[%s]</name>
          <description>Description collection: First PWM period started on sequence n</description>
          <addressOffset>0x108</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_SEQSTARTED</name>
              <description>First PWM period started on sequence n</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x2</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>EVENTS_SEQEND[%s]</name>
          <description>Description collection: Emitted at end of every sequence n, when last value from RAM has been applied to wave counter</description>
          <addressOffset>0x110</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_SEQEND</name>
              <description>Emitted at end of every sequence n, when last value from RAM has been applied to wave counter</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_PWMPERIODEND</name>
          <description>Emitted at the end of each PWM period</description>
          <addressOffset>0x118</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_PWMPERIODEND</name>
              <description>Emitted at the end of each PWM period</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_LOOPSDONE</name>
          <description>Concatenated sequences have been played the amount of times defined in LOOP.CNT</description>
          <addressOffset>0x11C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_LOOPSDONE</name>
              <description>Concatenated sequences have been played the amount of times defined in LOOP.CNT</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_RAMUNDERFLOW</name>
          <description>Emitted when a RAM fecth does not complete in time for the PWM module</description>
          <addressOffset>0x120</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_RAMUNDERFLOW</name>
              <description>Emitted when a RAM fecth does not complete in time for the PWM module</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x2</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>EVENTS_DMAREADY[%s]</name>
          <description>Description collection: Emitted when EasyDMA has fetched .PTR and .CNT registers for sequence n (they can be prepared for the next sequence)</description>
          <addressOffset>0x124</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_DMAREADY</name>
              <description>Emitted when EasyDMA has fetched .PTR and .CNT registers for sequence n (they can be prepared for the next sequence)</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
