adamkondraciuk/nrfx/mdk/nrf5340.svd
          <register>
            <name>CSN</name>
            <description>Pin select for chip select signal CSN. Connected to SPI interface pins of SPI-MEM-CTRL.</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>PIN</name>
                <description>Pin number</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>PORT</name>
                <description>Port number</description>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>CONNECT</name>
                <description>Connection</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disconnected</name>
                    <description>Disconnect</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Connected</name>
                    <description>Connect</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>CSN1</name>
            <description>Pin select for chip select signal CSN1. Not implemented!.</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
          </register>
          <register>
            <name>IO0</name>
            <description>Pin select for serial data MOSI/IO0. Connected to SPI interface pins of SPI-MEM-CTRL</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>PIN</name>
                <description>Pin number</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>PORT</name>
                <description>Port number</description>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>CONNECT</name>
                <description>Connection</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disconnected</name>
                    <description>Disconnect</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Connected</name>
                    <description>Connect</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>IO1</name>
            <description>Pin select for serial data MISO/IO1. Connected to SPI interface pins of SPI-MEM-CTRL.</description>
            <addressOffset>0x010</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>PIN</name>
                <description>Pin number</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>PORT</name>
                <description>Port number</description>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>CONNECT</name>
                <description>Connection</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disconnected</name>
                    <description>Disconnect</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Connected</name>
                    <description>Connect</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>IO2</name>
            <description>Pin select for serial data IO2. Connected to SPI interface pins of SPI-MEM-CTRL.</description>
            <addressOffset>0x014</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>PIN</name>
                <description>Pin number</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>PORT</name>
                <description>Port number</description>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>CONNECT</name>
                <description>Connection</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disconnected</name>
                    <description>Disconnect</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Connected</name>
                    <description>Connect</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>IO3</name>
            <description>Pin select for serial data IO3. Connected to SPI interface pins of SPI-MEM-CTRL.</description>
            <addressOffset>0x018</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>PIN</name>
                <description>Pin number</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>PORT</name>
                <description>Port number</description>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>CONNECT</name>
                <description>Connection</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disconnected</name>
                    <description>Disconnect</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Connected</name>
                    <description>Connect</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>XIPOFFSET</name>
          <description>Address offset into the external memory for Execute in Place operation.</description>
          <addressOffset>0x540</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>XIPOFFSET</name>
              <description>Address offset into the external memory for Execute in Place operation. Value must be a multiple of 4.</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>IFCONFIG0</name>
          <description>Interface configuration. SPI MEM CTRL Default Memory reg.</description>
          <addressOffset>0x544</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>READOC</name>
              <description>Configure number of data lines and opcode used for reading.</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FASTREAD</name>
                  <description>Single data line SPI. FAST_READ (opcode 0x0B).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READ2O</name>
                  <description>Dual data line SPI. READ2O (opcode 0x3B).</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READ2IO</name>
                  <description>Dual data line SPI. READ2IO (opcode 0xBB).</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READ4O</name>
                  <description>Quad data line SPI. READ4O (opcode 0x6B).</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READ4IO</name>
                  <description>Quad data line SPI. READ4IO (opcode 0xEB).</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WRITEOC</name>
              <description>Configure number of data lines and opcode used for writing.</description>
              <lsb>3</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PP</name>
                  <description>Single data line SPI. PP (opcode 0x02).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PP2O</name>
                  <description>Dual data line SPI. PP2O (opcode 0xA2).</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PP4O</name>
                  <description>Quad data line SPI. PP4O (opcode 0x32).</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PP4IO</name>
                  <description>Quad data line SPI. PP4IO (opcode 0x38).</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADDRMODE</name>
              <description>Addressing mode.</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>24BIT</name>
                  <description>24-bit addressing.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32BIT</name>
                  <description>32-bit addressing.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DPMENABLE</name>
              <description>Enable deep power-down mode (DPM) feature.</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Disable DPM feature.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Enable DPM feature.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CSNLINE</name>
              <description>Chip select line.</description>
              <lsb>8</lsb>
              <msb>10</msb>
            </field>
            <field>
              <name>AUTOID</name>
              <description>Automatic identification of external flash memory.</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Manual</name>
                  <description>Manual</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Automatic</name>
                  <description>Automatic</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PPSIZE</name>
              <description>Page size for commands PP, PP2O, PP4O and PP4IO.</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>256Bytes</name>
                  <description>256 bytes.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>512Bytes</name>
                  <description>512 bytes.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FIFOTH</name>
          <description>When writing to the IFCONFIG1 register the values for the FIFO thresholds are taken from this register. The DISABLE field can be set to ignore this register.</description>
          <addressOffset>0x548</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000404</resetValue>
          <fields>
            <field>
              <name>READ</name>
              <description>Read threshold.</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>WRITE</name>
              <description>Write threshold.</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>DISABLE</name>
              <description>Use or ignore this register.</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Use</name>
                  <description>Use contents of this register.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ignore</name>
                  <description>Do not use the contents of this register.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>IFCONFIG1</name>
          <description>Interface configuration. SPI MEM CTRL Control reg.</description>
          <addressOffset>0x600</addressOffset>
          <access>read-write</access>
          <resetValue>0x00040480</resetValue>
          <fields>
            <field>
              <name>SCKDELAY</name>
              <description>Minimum amount of time that the CSN pin must stay high before it can go low again. Value is specified in number of 16 MHz periods (62.5 ns).</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>FIFOTHR</name>
              <description>Read FIFO threshold.</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>FIFOTHW</name>
              <description>Write FIFO threshold.</description>
              <lsb>16</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>DPMEN</name>
              <description>Enter/exit deep power-down mode (DPM) for external flash memory.</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Exit</name>
                  <description>Exit DPM.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enter</name>
                  <description>Enter DPM.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPIMODE</name>
              <description>Select SPI mode.</description>
              <lsb>25</lsb>
              <msb>25</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MODE0</name>
                  <description>Mode 0: Data are captured on the clock rising edge and data is output on a falling edge. Base level of clock is 0 (CPOL=0, CPHA=0).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE3</name>
                  <description>Mode 3: Data are captured on the clock falling edge and data is output on a rising edge. Base level of clock is 1 (CPOL=1, CPHA=1).</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESET</name>
              <description>Reset external flash memory device. Write 1 to reset. Must be written back to 0 after a minimum delay of 1 us.</description>
              <lsb>26</lsb>
              <msb>26</msb>
            </field>
            <field>
              <name>SCKFREQ</name>
              <description>SCK frequency is given as 32 MHz / (SCKFREQ + 1).</description>
              <lsb>28</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <description>Status register. SPI MEM CTRL Status reg.</description>
          <addressOffset>0x604</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>RXDATAREADY</name>
              <description>Internal RX FIFO contains data from external flash.</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
            <field>
              <name>TXDATAREADY</name>
              <description>Internal TX FIFO contains data not yet written to external flash.</description>
              <lsb>1</lsb>
              <msb>1</msb>
            </field>
            <field>
              <name>DPM</name>
              <description>Deep power-down mode (DPM) status of external flash.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>External flash is not in DPM.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>External flash is in DPM.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>READY</name>
              <description>Ready status.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READY</name>
                  <description>QSPI peripheral is ready. It is allowed to trigger new tasks, writing custom instructions or enter/exit DPM.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUSY</name>
                  <description>QSPI peripheral is busy. It is not allowed to trigger any new tasks, writing custom instructions or enter/exit DPM.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REQREADY</name>
              <description>1: Ready to serve access request.</description>
              <lsb>4</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>SREG</name>
              <description>Value of external flash device Status Register. When the external flash has two bytes status register this field includes the value of the low byte.</description>
              <lsb>24</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ACCESSREQ0</name>
          <description>Access request, word 0. SPI MEM CTRL Access Request reg. 0.</description>
          <addressOffset>0x608</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ACCESSREQ0</name>
              <description>ACCESSREQ0</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ACCESSREQ1</name>
          <description>Access request, word 1. SPI MEM CTRL Access Request reg. 1.</description>
          <addressOffset>0x60C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>ACCESSREQ1</name>
              <description>ACCESSREQ1</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ACCESSREQ2</name>
          <description>Access request, word 2. SPI MEM CTRL Access Request reg. 2.</description>
          <addressOffset>0x610</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>ACCESSREQ2</name>
              <description>ACCESSREQ2</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DPMDUR</name>
          <description>Set the duration required to enter/exit deep power-down mode (DPM). SPI MEM CTRL Duration DPM reg.</description>
          <addressOffset>0x614</addressOffset>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>ENTER</name>
              <description>Duration needed by external flash to enter DPM. Duration is given as ENTER * 256 * 62.5 ns.</description>
              <lsb>0</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>EXIT</name>
              <description>Duration needed by external flash to exit DPM. Duration is given as EXIT * 256 * 62.5 ns.</description>
              <lsb>16</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
