adamkondraciuk/nrfx/mdk/nrf5340.svd
        <register>
          <name>DATARW</name>
          <description>Read data when read, write data when written. SPI MEM CTRL Read/Write Data reg.</description>
          <addressOffset>0x618</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DATARW</name>
              <description>DATARW</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>FIFOSTAT</name>
          <description>The number of items in Read and Write FIFOs. SPI MEM CTRL FIFOs Status reg.</description>
          <addressOffset>0x61C</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>FIFOSTAT</name>
              <description>FIFOSTAT</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DEFMEM</name>
          <description>Default memory register. SPI MEM Default memory register. Fields and content equivalent to IFCONFIG0.</description>
          <addressOffset>0x620</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>DEFMEM</name>
              <description>Default memory register.</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ADDRCONF</name>
          <description>Extended address configuration. SPI MEM CTRL Extended Addressing Mode reg.</description>
          <addressOffset>0x624</addressOffset>
          <access>read-write</access>
          <resetValue>0x000000B7</resetValue>
          <fields>
            <field>
              <name>OPCODE</name>
              <description>Opcode that enters the 32-bit addressing mode.</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>BYTE0</name>
              <description>Byte 0 following opcode.</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>BYTE1</name>
              <description>Byte 1 following byte 0.</description>
              <lsb>16</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>MODE</name>
              <description>Extended addressing mode.</description>
              <lsb>24</lsb>
              <msb>25</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NoInstr</name>
                  <description>Do not send any instruction.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Opcode</name>
                  <description>Send opcode.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OpByte0</name>
                  <description>Send opcode, byte0.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>All</name>
                  <description>Send opcode, byte0, byte1.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WIPWAIT</name>
              <description>Wait for write complete before sending command.</description>
              <lsb>26</lsb>
              <msb>26</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>No wait.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Wait.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WREN</name>
              <description>Send WREN (write enable opcode 0x06) before instruction.</description>
              <lsb>27</lsb>
              <msb>27</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Do not send WREN.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Send WREN.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MEMSPEC</name>
          <description>Byte specification: 1 byte manufacture ID, 1 byte memory type, 1 byte density. SPI MEM CTRL Memory Specification reg.</description>
          <addressOffset>0x628</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MEMSPEC</name>
              <description>MEMSPEC</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>IRQMSK</name>
          <description>Interrupts enable disable mask. SPI MEM CTRL Interrupt Mask reg.</description>
          <addressOffset>0x62C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IRQMSK</name>
              <description>IRQMSK</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>IRQREQ</name>
          <description>Interrupt request register (reason for triggering interrupt signal). SPI MEM CTRL Interrupt Request reg.</description>
          <addressOffset>0x630</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IRQREQ</name>
              <description>IRQREQ</description>
              <lsb>0</lsb>
              <msb>2</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CINSTRCONF</name>
          <description>Custom instruction configuration register. SPI MEM CTRL Custom Instruction Setup reg.</description>
          <addressOffset>0x634</addressOffset>
          <access>read-write</access>
          <resetValue>0x00002000</resetValue>
          <fields>
            <field>
              <name>OPCODE</name>
              <description>Opcode of Custom instruction.</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>LENGTH</name>
              <description>Length of custom instruction in number of bytes.</description>
              <lsb>8</lsb>
              <msb>11</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1B</name>
                  <description>Send opcode only.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2B</name>
                  <description>Send opcode, CINSTRDAT0.BYTE0.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3B</name>
                  <description>Send opcode, CINSTRDAT0.BYTE0 -&amp;gt; CINSTRDAT0.BYTE1.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4B</name>
                  <description>Send opcode, CINSTRDAT0.BYTE0 -&amp;gt; CINSTRDAT0.BYTE2.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>5B</name>
                  <description>Send opcode, CINSTRDAT0.BYTE0 -&amp;gt; CINSTRDAT0.BYTE3.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6B</name>
                  <description>Send opcode, CINSTRDAT0.BYTE0 -&amp;gt; CINSTRDAT1.BYTE4.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>7B</name>
                  <description>Send opcode, CINSTRDAT0.BYTE0 -&amp;gt; CINSTRDAT1.BYTE5.</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8B</name>
                  <description>Send opcode, CINSTRDAT0.BYTE0 -&amp;gt; CINSTRDAT1.BYTE6.</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>9B</name>
                  <description>Send opcode, CINSTRDAT0.BYTE0 -&amp;gt; CINSTRDAT1.BYTE7.</description>
                  <value>9</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LIO2</name>
              <description>Level of the IO2 pin (if connected) during transmission of custom instruction.</description>
              <lsb>12</lsb>
              <msb>12</msb>
            </field>
            <field>
              <name>LIO3</name>
              <description>Level of the IO3 pin (if connected) during transmission of custom instruction.</description>
              <lsb>13</lsb>
              <msb>13</msb>
            </field>
            <field>
              <name>WIPWAIT</name>
              <description>Wait for write complete before sending command.</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>No wait.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Wait.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WREN</name>
              <description>Send WREN (write enable opcode 0x06) before instruction.</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Do not send WREN.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Send WREN.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LFEN</name>
              <description>Enable long frame mode. When enabled, a custom instruction transaction has to be ended by writing the LFSTOP field.</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Long frame mode disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Long frame mode enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LFSTOP</name>
              <description>Stop (finalize) long frame transaction</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Stop</name>
                  <description>Stop</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CINSTRDAT0</name>
          <description>Custom instruction data register 0. SPI MEM CTRL Custom Instruction Data reg. 0.</description>
          <addressOffset>0x638</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>BYTE0</name>
              <description>Data byte 0</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>BYTE1</name>
              <description>Data byte 1</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>BYTE2</name>
              <description>Data byte 2</description>
              <lsb>16</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>BYTE3</name>
              <description>Data byte 3</description>
              <lsb>24</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CINSTRDAT1</name>
          <description>Custom instruction data register 1. SPI MEM CTRL Custom Instruction Data reg. 1.</description>
          <addressOffset>0x63C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>BYTE4</name>
              <description>Data byte 4</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>BYTE5</name>
              <description>Data byte 5</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>BYTE6</name>
              <description>Data byte 6</description>
              <lsb>16</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>BYTE7</name>
              <description>Data byte 7</description>
              <lsb>24</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>IFTIMING</name>
          <description>SPI interface timing. SPI MEM CTRL Read Dummy Cycles reg.</description>
          <addressOffset>0x640</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000200</resetValue>
          <fields>
            <field>
              <name>RDC2IO</name>
              <description>Number of 64 MHz dummy Cycles for READ2IO Instruction (opcode BB).</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>RDC4IO</name>
              <description>Number of 64 MHz dummy Cycles for READ4IO Instruction (opcode EB).</description>
              <lsb>4</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>RXDELAY</name>
              <description>Timing related to sampling of the input serial data. The value of RXDELAY specifies the number of 64 MHz cycles (15.625 ns) delay from the the rising edge of the SPI Clock (SCK) until the input serial data is sampled. As en example, if set to 0 the input serial data is sampled on the rising edge of SCK.</description>
              <lsb>8</lsb>
              <msb>10</msb>
            </field>
          </fields>
        </register>
