adamkondraciuk/nrfx/mdk/nrf5340.svd
        <register>
          <name>DEMODCONFIG</name>
          <description>Configuration settings for demodulation</description>
          <addressOffset>0x61C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>EDGEDETRSTDELAY</name>
              <description>Time between the falling edge of the NFC pulse and the time when reset is applied, in number of 13.56 MHz clocks</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>DEMODEDGEDETECT</name>
              <description>Selects if an edge detector is enabled to detect the rising edge of an NFC pulse</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>No edge detector - the rising edge of LOCKDETECT or DEMODLEV is used directly</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Edge detector enabled on the rising edge of the NFC pulse</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FIELDDETECTCONFIG</name>
          <description>Configuration for NFCT_FIELDDETECT_TSMC55N</description>
          <addressOffset>0x620</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>FIELDDETECTLEVEL</name>
              <description>Sets the fielddetect level to a value between 0 and 7 (not implemented)</description>
              <lsb>0</lsb>
              <msb>2</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ANALOGTESTBUSEN</name>
          <description>Analog Testbus Enable - ATB0 only</description>
          <addressOffset>0x624</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ANALOGTESTBUSEN</name>
              <description>Analog Testbus Enable - ATB0 only</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRISTATE</name>
                  <description>Tristate</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VCOTUNINGVOLTAGE</name>
                  <description>VCO tuning voltage</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMFBOFFSETCOMP</name>
                  <description>Divided Common mode of NFC1 and NFC2 at the CMFB OFFSET comparator</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VREFPEAKDETECTORREF</name>
                  <description>VREF for peak detector reference</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VREFPEAKFORPEAKDET</name>
                  <description>VREF_PEAK for peak detection</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PEAKDETECTOROUTPUT</name>
                  <description>Peak detector output</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V2IOUTPUTVOLTAGE</name>
                  <description>Divided V2I output voltage</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTEGRATOROUTPUT</name>
                  <description>Divided Integrator output</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SYMBOLTOLLOWER</name>
          <description>Configuration register for the tolerance of the received NFC pulse width</description>
          <addressOffset>0x628</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000002</resetValue>
          <fields>
            <field>
              <name>SYMBOLTOLLOWER</name>
              <description>Minimum allowable received NFC pulse width, given in pulses of 13.56 MHz clock</description>
              <lsb>0</lsb>
              <msb>5</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>SYMBOLTOLUPPER</name>
          <description>Configuration register for the tolerance of the received NFC pulse width</description>
          <addressOffset>0x62C</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000003F</resetValue>
          <fields>
            <field>
              <name>SYMBOLTOLUPPER</name>
              <description>Maximum allowable received NFC pulse width, given in pulses of 13.56 MHz clock</description>
              <lsb>0</lsb>
              <msb>5</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CONTINUOUSSUBCARRIER</name>
          <description>Selects continuous sub-carrier transmission</description>
          <addressOffset>0x630</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CONTINUOUSSUBCARRIER</name>
              <description>Selects continuous sub-carrier transmission</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Normal</name>
                  <description>Normal modulation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Carrier</name>
                  <description>Continuous sub-carrier transmission</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CLOCKRECCONFIG</name>
          <description>Configuration for NFCT_CLOCKREC_TSMC55N</description>
          <addressOffset>0x63C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HYSTERESISLEVELSELECT</name>
              <description>Selects the hysteresis level</description>
              <lsb>1</lsb>
              <msb>1</msb>
            </field>
            <field>
              <name>REF13M56OUTPUTENABLE</name>
              <description>Enables the nfcRef13M56 reference clock output</description>
              <lsb>2</lsb>
              <msb>2</msb>
            </field>
            <field>
              <name>PHASEDETREFIN_0</name>
              <description>Sets the reference input of the phase detector to 0</description>
              <lsb>3</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>PHASEDETOSCIN_0</name>
              <description>Sets the oscillator input of the phase detector to 0</description>
              <lsb>4</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>OVRXORPHASEDET</name>
              <description>Override the output of the XOR phase detector to 1</description>
              <lsb>5</lsb>
              <msb>5</msb>
            </field>
            <field>
              <name>FLOATPHASEDETOUTPUT</name>
              <description>Set the output of the phase to high-Z</description>
              <lsb>6</lsb>
              <msb>6</msb>
            </field>
            <field>
              <name>ENABLERXHYSTERESIS</name>
              <description>Enables RX hysteresis in the sine-to-square converter</description>
              <lsb>8</lsb>
              <msb>8</msb>
            </field>
            <field>
              <name>ENABLETXHYSTERESIS</name>
              <description>Enables TX hysteresis in the sine-to-square converter</description>
              <lsb>9</lsb>
              <msb>9</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CLOCKSOURCE</name>
          <description>Deprecated register - Clock source</description>
          <addressOffset>0x640</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CLOCKSOURCE</name>
              <description>Clock source</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Normal</name>
                  <description>Normal mode - Use 13.56 MHz and 16 MHz clocks</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16MHz</name>
                  <description>Use 16 MHz clock only</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FRAMECONTENT1</name>
          <description>Deprecated register - Buffer for custom-frame autoresponse frame-content, when no DMA is available</description>
          <addressOffset>0x644</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FRAMECONTENT1</name>
              <description>Buffer for custom-frame autoresponse (AUTORESPONSEMODE=CustomFrame), when no DMA is available</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>FRAMECONTENT2</name>
          <description>Deprecated register - Buffer for custom-frame autoresponse, when no DMA is available</description>
          <addressOffset>0x648</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FRAMECONTENT2</name>
              <description>Buffer for custom-frame autoresponse (AUTORESPONSEMODE=CustomFrame), when no DMA is available</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>OVERRIDEENABLE</name>
          <description>Enables override functionality.</description>
          <addressOffset>0x650</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OVRENPWRUP</name>
              <description>Override enable for OVERRIDE_PWRUP</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
            <field>
              <name>OVRENMODULATION</name>
              <description>Override enable for modulation on/off</description>
              <lsb>1</lsb>
              <msb>1</msb>
            </field>
            <field>
              <name>OVRENROSCCALCODE</name>
              <description>Override enable for OVERRIDE_ROSCCALCODE</description>
              <lsb>5</lsb>
              <msb>5</msb>
            </field>
            <field>
              <name>OVRENROSCCALEN</name>
              <description>Override enable for OVERRIDE_ROSCCALEN</description>
              <lsb>6</lsb>
              <msb>6</msb>
            </field>
            <field>
              <name>OVRENCLAMPEN2V2</name>
              <description>Override enable for the 2V2 clamp</description>
              <lsb>7</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>OVRENCLAMPEN3V6</name>
              <description>Override enable for the 3V6 clamp</description>
              <lsb>8</lsb>
              <msb>8</msb>
            </field>
            <field>
              <name>OVRENPEAKDETECTREF</name>
              <description>Override enable for peak detect reference voltage. Uses value from OVRVALPEAKDETECTREF.</description>
              <lsb>11</lsb>
              <msb>11</msb>
            </field>
            <field>
              <name>OVRENPWRUPRES</name>
              <description>Override enable for power up resistor in the analog pad. Uses value from OVRVALPWRUPRES.</description>
              <lsb>12</lsb>
              <msb>12</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>OVRVALPWRUPNFC</name>
          <description>Override value for pwrupNfc</description>
          <addressOffset>0x660</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OVRVALPWRUPNFC</name>
              <description>Override value for pwrupNfc</description>
              <lsb>0</lsb>
              <msb>1</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>OVRVALMODULATION</name>
          <description>Override value for modulation on/off</description>
          <addressOffset>0x664</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OVRVALMODULATION</name>
              <description>Override value for modulation on/off</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>OVRVALLOADINACTIVE</name>
          <description>Override value for the load control when modulation is off</description>
          <addressOffset>0x668</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OVRVALLOADINACTIVE</name>
              <description>Override value for the load control when modulation is off</description>
              <lsb>0</lsb>
              <msb>5</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>OVRVALLOADACTIVE</name>
          <description>Override value for the load control when modulation is on</description>
          <addressOffset>0x66C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OVRVALLOADACTIVE</name>
              <description>Override value for the load control when modulation is on</description>
              <lsb>0</lsb>
              <msb>5</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>OVRVALPWRUPRES</name>
          <description>Override value for power up resistor in the analog pad</description>
          <addressOffset>0x670</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>OVRVALPWRUPRES</name>
              <description>Override value for power up resistor in the analog pad</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>OVRVALROSCCALCODE</name>
          <description>Override value for the calibration word for the oscillator</description>
          <addressOffset>0x674</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000000F</resetValue>
          <fields>
            <field>
              <name>OVRVALROSCCALCODE</name>
              <description>Override value for the calibration word for the oscillator</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>OVRVALROSCCALEN</name>
          <description>Override value for the signal CALEN going to the oscillator</description>
          <addressOffset>0x678</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OVRVALROSCCALEN</name>
              <description>Override value for the calibration word for the oscillator</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>OVRVALCLAMPEN2V2</name>
          <description>Override value for the 2V2 clamp</description>
          <addressOffset>0x67C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OVRVALCLAMPEN2V2</name>
              <description>Override value for the 2V2 clamp</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>OVRVALCLAMPEN3V6</name>
          <description>Override value for the 3V6 clamp</description>
          <addressOffset>0x680</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OVRVALCLAMPEN3V6</name>
              <description>Override value for the 3V6 clamp</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>AUTOCAL</name>
          <description>Controls auto-calibration at NFCT module enabling</description>
          <addressOffset>0x684</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>ROSCEN</name>
              <description>Controls auto-calibration at NFCT module enabling</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>No auto-calibration at module enablin</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable auto-calibration at module enabling</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
