adamkondraciuk/nrfx/mdk/nrf5340.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="P0_NS">
      <name>P1_NS</name>
      <description>GPIO Port 1</description>
      <baseAddress>0x408C0800</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
    </peripheral>
    <peripheral derivedFrom="P0_NS">
      <name>P0_S</name>
      <description>GPIO Port 2</description>
      <baseAddress>0x508C0500</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
    </peripheral>
    <peripheral derivedFrom="P0_NS">
      <name>P1_S</name>
      <description>GPIO Port 3</description>
      <baseAddress>0x508C0800</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
    </peripheral>
    <peripheral>
      <name>CRYPTOCELL_S</name>
      <description>ARM TrustZone CryptoCell register interface</description>
      <baseAddress>0x508C1000</baseAddress>
      <headerStructName>CRYPTOCELL</headerStructName>
      <!--Security dma=NSA-->
      <!--Security securemapping=S-->
      <addressBlock>
        <offset>0</offset>
        <size>0x2000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>CRYPTOCELL</name>
        <value>193</value>
      </interrupt>
      <groupName>CRYPTOCELL</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>ENABLE</name>
          <description>Control power and clock for CRYPTOCELL subsystem</description>
          <addressOffset>0x500</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable or disable the CRYPTOCELL subsystem</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>CRYPTOCELL subsystem disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>CRYPTOCELL subsystem enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RESET</name>
          <description>Perform an external reset of the CRYPTOCELL subsystem.</description>
          <addressOffset>0x504</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RESET</name>
              <description>Reset CRYPTOCELL subsystem</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>CRYPTOCELL subsystem normal operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Perform CRYPTOCELL subsystem reset</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>IRQ_STATUS</name>
          <description>Holds the interrupt status from the CRYPTOCELL subsystems.</description>
          <addressOffset>0x508</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IRQ_STATUS</name>
              <description>A read will return the current status of the CRYPTOCELL interrupt signal</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TSEL</name>
          <description>Timing select (TSEL) settings for CRYPTOCELL dedicated PKA and RNG SRAM blocks.</description>
          <addressOffset>0x50C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000011</resetValue>
          <fields>
            <field>
              <name>PKASRAM</name>
              <description>Control timing for PKA SRAM block</description>
              <lsb>0</lsb>
              <msb>1</msb>
            </field>
            <field>
              <name>RNGSRAM</name>
              <description>Control timing for RNG SRAM block</description>
              <lsb>4</lsb>
              <msb>5</msb>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
  </peripherals>
</device>